var data = [
    {
        "time": "0.07:26",
        "name": "01-Java新版视频教程简介"
    },
    {
        "time": "0.06:23",
        "name": "02-Java语言概述-课程目录说明"
    },
    {
        "time": "0.11:55",
        "name": "03-Java语言概述-Java基础全程学习路线"
    },
    {
        "time": "0.23:20",
        "name": "04-Java语言概述-抽丝剥茧话Java"
    },
    {
        "time": "0.15:26",
        "name": "05-Java语言概述-Java工程师全程学习路线"
    },
    {
        "time": "0.07:13",
        "name": "06-Java语言概述-计算机硬件的介绍"
    },
    {
        "time": "0.20:30",
        "name": "07-Java语言概述-常见的DOS命令"
    },
    {
        "time": "0.24:27",
        "name": "08-Java语言概述-不同编程语言的介绍"
    },
    {
        "time": "0.15:45",
        "name": "09-Java语言概述-Java相关历史"
    },
    {
        "time": "0.10:06",
        "name": "10-Java语言概述-JDK的选择和下载"
    },
    {
        "time": "0.14:09",
        "name": "11-Java语言概述-JDK8的安装与path环境变量的配置"
    },
    {
        "time": "0.05:53",
        "name": "12-Java语言概述-JDK17的安装和path环境变量的配置"
    },
    {
        "time": "0.16:47",
        "name": "13-Java语言概述-HelloWorld的编写和执行"
    },
    {
        "time": "0.34:12",
        "name": "14-Java语言概述-第一个HelloWorld程序的总结"
    },
    {
        "time": "0.14:24",
        "name": "15-Java语言概述-单行注释和多行注释的使用"
    },
    {
        "time": "0.12:32",
        "name": "16-Java语言概述-文档注释的使用与API文档的说明"
    },
    {
        "time": "0.15:14",
        "name": "17-Java语言概述-Java语言的特点和JVM的功能"
    },
    {
        "time": "0.09:08",
        "name": "18-Java语言概述-两个案例的代码实现"
    },
    {
        "time": "0.30:32",
        "name": "19-Java语言概述-第01章复习与企业真题"
    },
    {
        "time": "0.22:43",
        "name": "20-Java语言概述-学习的方法和经验"
    },
    {
        "time": "0.05:38",
        "name": "21-变量与运算符-关键字的使用"
    },
    {
        "time": "0.24:32",
        "name": "22-变量与运算符-标识符的使用"
    },
    {
        "time": "0.25:00",
        "name": "23-变量与运算符-变量的基本使用"
    },
    {
        "time": "0.11:16",
        "name": "24-变量与运算符-整型数据类型的使用"
    },
    {
        "time": "0.19:32",
        "name": "25-变量与运算符-浮点类型的使用及练习"
    },
    {
        "time": "0.16:18",
        "name": "26-变量与运算符-字符类型的使用"
    },
    {
        "time": "0.06:15",
        "name": "27-变量与运算符-布尔类型的使用"
    },
    {
        "time": "0.26:45",
        "name": "28-变量与运算符-基本数据类型变量间的自动类型提升规则"
    },
    {
        "time": "0.18:24",
        "name": "29-变量与运算符-基本数据类型变量间的强制类型转换规则"
    },
    {
        "time": "0.22:00",
        "name": "30-变量与运算符-String类的基本使用"
    },
    {
        "time": "0.12:52",
        "name": "31-变量与运算符-String类的课后练习"
    },
    {
        "time": "0.31:13",
        "name": "32-变量与运算符-常见进制的理解与二进制转十进制操作"
    },
    {
        "time": "0.12:09",
        "name": "33-变量与运算符-十进制转二进制_其它进制间的相互转换"
    },
    {
        "time": "0.39:49",
        "name": "34-变量与运算符-算术运算符的使用"
    },
    {
        "time": "0.24:02",
        "name": "35-变量与运算符-赋值运算符的使用"
    },
    {
        "time": "0.15:36",
        "name": "36-变量与运算符-比较运算符的使用"
    },
    {
        "time": "0.30:01",
        "name": "37-变量与运算符-逻辑运算符的使用"
    },
    {
        "time": "0.36:13",
        "name": "38-变量与运算符-位运算符的使用"
    },
    {
        "time": "0.27:45",
        "name": "39-变量与运算符-条件运算符的使用"
    },
    {
        "time": "0.54:49",
        "name": "40-变量与运算符-第02章复习与企业真题"
    },
    {
        "time": "0.30:23",
        "name": "41-流程控制-if-else结构的基本使用"
    },
    {
        "time": "0.19:01",
        "name": "42-流程控制-if-else结构的嵌套使用及课后练习"
    },
    {
        "time": "0.29:35",
        "name": "43-流程控制-使用Scanner类从键盘获取数据"
    },
    {
        "time": "0.11:50",
        "name": "44-流程控制-如何获取一个随机数"
    },
    {
        "time": "0.29:38",
        "name": "45-流程控制-switch-case的基本使用"
    },
    {
        "time": "0.45:34",
        "name": "46-流程控制-switch-case的课后练习1,2"
    },
    {
        "time": "0.26:22",
        "name": "47-流程控制-for循环结构的基本使用"
    },
    {
        "time": "0.25:56",
        "name": "48-流程控制-for循环结构的课后练习"
    },
    {
        "time": "0.32:28",
        "name": "49-流程控制-while循环结构的使用及课后练习"
    },
    {
        "time": "0.36:22",
        "name": "50-流程控制-do-while循环的使用及课后练习"
    },
    {
        "time": "0.14:59",
        "name": "51-流程控制-无限循环结构的使用"
    },
    {
        "time": "0.25:42",
        "name": "52-流程控制-嵌套循环的使用"
    },
    {
        "time": "0.15:45",
        "name": "53-流程控制-使用嵌套for循环显示菱形、九九乘法表"
    },
    {
        "time": "0.20:25",
        "name": "54-流程控制-关键字break和continue的使用"
    },
    {
        "time": "0.37:57",
        "name": "55-流程控制-通过质数的输出体会算法的魅力"
    },
    {
        "time": "0.40:59",
        "name": "56-流程控制-项目一：谷粒记账软件的演示及代码实现"
    },
    {
        "time": "0.21:07",
        "name": "57-流程控制-企业中项目的研发流程"
    },
    {
        "time": "0.34:20",
        "name": "58-流程控制-第03章复习与企业真题"
    },
    {
        "time": "0.25:48",
        "name": "59-IDEA开发工具-IDEA的介绍、卸载、安装与注册"
    },
    {
        "time": "0.41:27",
        "name": "60-IDEA开发工具-HelloWorld的编写与相关必备设置"
    },
    {
        "time": "0.40:54",
        "name": "61-IDEA开发工具-工程、模块、包、类的理解_第04章复习与企业真题"
    },
    {
        "time": "0.28:23",
        "name": "62-数组-数组的概述"
    },
    {
        "time": "0.40:47",
        "name": "63-数组-一维数组的初始化、遍历与元素默认初始化值"
    },
    {
        "time": "0.25:14",
        "name": "64-数组-一维数组的内存解析"
    },
    {
        "time": "0.28:15",
        "name": "65-数组-一维数组的课后练习1-3"
    },
    {
        "time": "0.45:28",
        "name": "66-数组-二维数组的初始化、遍历与元素默认初始化值"
    },
    {
        "time": "0.40:49",
        "name": "67-数组-二维数组的内存解析与课后练习1-3"
    },
    {
        "time": "0.52:40",
        "name": "68-数组-常见算法操作：特征值计算、数组赋值与复制"
    },
    {
        "time": "0.36:35",
        "name": "69-数组-常见算法操作：数组的反转、扩容与缩容"
    },
    {
        "time": "1:04:34",
        "name": "70-数组-常见算法操作：查找、冒泡排序、快速排序"
    },
    {
        "time": "0.30:02",
        "name": "71-数组-Arrays工具类的使用与数组中的常见异常"
    },
    {
        "time": "0.32:43",
        "name": "72-数组-第05章复习与企业真题"
    },
    {
        "time": "0.33:10",
        "name": "73-面向对象(基础)-面向对象的概述及两大要素：类与对象"
    },
    {
        "time": "0.52:39",
        "name": "74-面向对象(基础)-类的实例化与对象的内存解析"
    },
    {
        "time": "1:01:32",
        "name": "75-面向对象(基础)-成员变量与局部变量的对比及练习"
    },
    {
        "time": "0.56:06",
        "name": "76-面向对象(基础)-方法的作用与方法的声明"
    },
    {
        "time": "0.26:28",
        "name": "77-面向对象(基础)-方法的课后练习及内存解析"
    },
    {
        "time": "0.47:41",
        "name": "78-面向对象(基础)-属性和方法的整体练习1-4"
    },
    {
        "time": "0.37:31",
        "name": "79-面向对象(基础)-对象数组的使用及内存解析"
    },
    {
        "time": "0.30:20",
        "name": "80-面向对象(基础)-方法应用1：方法的重载"
    },
    {
        "time": "0.23:07",
        "name": "81-面向对象(基础)-方法应用2：可变个数形参的方法"
    },
    {
        "time": "1:08:34",
        "name": "82-面向对象(基础)-方法应用3：方法值传递机制的剖析"
    },
    {
        "time": "0.42:31",
        "name": "83-面向对象(基础)-方法应用4：递归方法"
    },
    {
        "time": "0.41:33",
        "name": "84-面向对象(基础)-package与import关键字的使用"
    },
    {
        "time": "0.46:14",
        "name": "85-面向对象(基础)-面向对象的特征一：封装性"
    },
    {
        "time": "0.37:15",
        "name": "86-面向对象(基础)-封装性课后练习与几种不同权限修饰符的测试"
    },
    {
        "time": "1:01:07",
        "name": "87-面向对象(基础)-类的成员之三：构造器的使用与练习1-3"
    },
    {
        "time": "0.32:22",
        "name": "88-面向对象(基础)-实例变量赋值过程_JavaBean_UML类图"
    },
    {
        "time": "0.57:08",
        "name": "89-面向对象(基础)-第06章复习与企业真题"
    },
    {
        "time": "0.34:24",
        "name": "90-面向对象(进阶)-关键字this调用属性、方法、构造器"
    },
    {
        "time": "0.50:42",
        "name": "91-面向对象(进阶)-this课后练习1,2"
    },
    {
        "time": "0.54:03",
        "name": "92-面向对象(进阶)-项目二：拼电商客户管理系统的演示及代码实现"
    },
    {
        "time": "0.50:20",
        "name": "93-面向对象(进阶)-面向对象的特征二：继承性"
    },
    {
        "time": "0.32:50",
        "name": "94-面向对象(进阶)-继承性课后练习1,2与4种权限修饰的测试"
    },
    {
        "time": "0.44:22",
        "name": "95-面向对象(进阶)-方法的重写规则及练习1,2"
    },
    {
        "time": "0.40:48",
        "name": "96-面向对象(进阶)-关键字super调用父类属性、方法、构造器"
    },
    {
        "time": "0.38:27",
        "name": "97-面向对象(进阶)-super的课后练习1-3与企业真题"
    },
    {
        "time": "0.13:29",
        "name": "98-面向对象(进阶)-子类对象实例化的全过程"
    },
    {
        "time": "0.45:28",
        "name": "99-面向对象(进阶)-面向对象的特征三：多态性"
    },
    {
        "time": "1:13:00",
        "name": "100-面向对象(进阶)-向下转型与多态性课后练习1-4"
    },
    {
        "time": "0.28:14",
        "name": "101-面向对象(进阶)-Object类及clone()、finalize()的理解"
    },
    {
        "time": "0.46:17",
        "name": "102-面向对象(进阶)-equals()方法的使用及练习1-2"
    },
    {
        "time": "0.23:59",
        "name": "103-面向对象(进阶)-toString()方法的使用及练习"
    },
    {
        "time": "0.52:36",
        "name": "104-面向对象(进阶)-第07章复习与企业真题"
    },
    {
        "time": "0.54:41",
        "name": "105-面向对象(高级)-关键字static修饰属性、方法"
    },
    {
        "time": "0.21:15",
        "name": "106-面向对象(高级)-static的应用举例及练习1,2"
    },
    {
        "time": "0.53:17",
        "name": "107-面向对象(高级)-单例设计模式与main()的理解"
    },
    {
        "time": "0.35:25",
        "name": "108-面向对象(高级)-类的成员之四：代码块"
    },
    {
        "time": "0.43:17",
        "name": "109-面向对象(高级)-小结：类中属性赋值的位置及过程"
    },
    {
        "time": "0.31:56",
        "name": "110-面向对象(高级)-关键字final的使用及真题"
    },
    {
        "time": "0.39:10",
        "name": "111-面向对象(高级)-抽象类与抽象方法的使用"
    },
    {
        "time": "0.41:53",
        "name": "112-面向对象(高级)-模板方法设计模式及抽象课后练习"
    },
    {
        "time": "0.49:23",
        "name": "113-面向对象(高级)-接口的使用"
    },
    {
        "time": "0.44:50",
        "name": "114-面向对象(高级)-接口的课后练习1-3"
    },
    {
        "time": "0.21:28",
        "name": "115-面向对象(高级)-JDK8和JDK9中接口的新特性"
    },
    {
        "time": "1:05:43",
        "name": "116-面向对象(高级)-类的成员之五：内部类"
    },
    {
        "time": "1:00:56",
        "name": "117-面向对象(高级)-枚举类的两种定义方式及练习"
    },
    {
        "time": "1:00:15",
        "name": "118-面向对象(高级)-Annotation注解、单元测试的使用"
    },
    {
        "time": "0.42:41",
        "name": "119-面向对象(高级)-包装类的理解_基本数据类型与包装类间的转换"
    },
    {
        "time": "0.45:33",
        "name": "120-面向对象(高级)-String与基本数据类型、包装类间的转换及练习"
    },
    {
        "time": "0.36:13",
        "name": "121-面向对象(高级)-IDEA中快捷键的使用和修改"
    },
    {
        "time": "0.30:43",
        "name": "122-面向对象(高级)-IDEA中如何调试程序"
    },
    {
        "time": "1:11:10",
        "name": "123-面向对象(高级)-第08章复习与企业真题"
    },
    {
        "time": "0.47:06",
        "name": "124-异常处理-异常的概述与常见异常的举例"
    },
    {
        "time": "0.36:02",
        "name": "125-异常处理-异常处理方式一：try-catch的使用"
    },
    {
        "time": "0.29:14",
        "name": "126-异常处理-finally的使用"
    },
    {
        "time": "0.27:57",
        "name": "127-异常处理-异常处理方式二：throws"
    },
    {
        "time": "0.25:56",
        "name": "128-异常处理-使用throw手动抛出异常对象"
    },
    {
        "time": "0.39:31",
        "name": "129-异常处理-如何自定义异常类及课后练习"
    },
    {
        "time": "2:00:18",
        "name": "130-异常处理-项目三：优尚开发团队人员调度系统的介绍、开发与测试"
    },
    {
        "time": "0.38:52",
        "name": "131-异常处理-第09章复习与企业真题"
    },
    {
        "time": "0.36:31",
        "name": "132-多线程-程序、进程、线程与并行、并发的概念"
    },
    {
        "time": "0.24:10",
        "name": "133-多线程-线程创建方式1：继承Thread类"
    },
    {
        "time": "0.36:59",
        "name": "134-多线程-线程创建方式2：实现Runnable接口"
    },
    {
        "time": "0.46:04",
        "name": "135-多线程-Thread类的常用方法和生命周期"
    },
    {
        "time": "0.45:44",
        "name": "136-多线程-同步代码块解决两种线程创建方式的线程安全问题"
    },
    {
        "time": "0.35:12",
        "name": "137-多线程-同步方法解决两种线程创建方式的线程安全问题"
    },
    {
        "time": "0.59:46",
        "name": "138-多线程-线程安全的懒汉式_死锁_ReentrantLock的使用"
    },
    {
        "time": "0.46:45",
        "name": "139-多线程-线程间的通信机制与生产者消费者案例"
    },
    {
        "time": "0.26:43",
        "name": "140-多线程-线程的创建方式3、4：实现Callable与线程池"
    },
    {
        "time": "0.42:32",
        "name": "141-多线程-第10章复习与企业真题"
    },
    {
        "time": "0.36:49",
        "name": "142-常用类与基础API-String的理解与不可变性"
    },
    {
        "time": "0.37:09",
        "name": "143-常用类与基础API-String的实例化与连接操作"
    },
    {
        "time": "0.59:49",
        "name": "144-常用类与基础API-String的构造器与常用方法"
    },
    {
        "time": "0.45:16",
        "name": "145-常用类与基础API-String的课后练习1-3"
    },
    {
        "time": "0.53:32",
        "name": "146-常用类与基础API-StringBuffer与StringBuilder的源码分析、常用方法"
    },
    {
        "time": "0.48:03",
        "name": "147-常用类与基础API-JDK8之前日期时间API的使用：Date、SimpleDateFormat、Calendar"
    },
    {
        "time": "0.43:04",
        "name": "148-常用类与基础API-JDK8中新的日期时间API的使用和练习"
    },
    {
        "time": "0.26:37",
        "name": "149-常用类与基础API-使用Comparable接口实现自然排序"
    },
    {
        "time": "0.27:25",
        "name": "150-常用类与基础API-使用Comparator接口实现定制排序及对比"
    },
    {
        "time": "0.37:29",
        "name": "151-常用类与基础API-其它常用类的使用：BigInteger、BigDecimal、Random等"
    },
    {
        "time": "0.35:52",
        "name": "152-常用类与基础API-第11章复习与企业真题"
    },
    {
        "time": "0.35:04",
        "name": "153-集合框架-数组的特点、弊端与集合框架体系介绍"
    },
    {
        "time": "1:15:26",
        "name": "154-集合框架-Collection接口中的方法测试"
    },
    {
        "time": "0.21:09",
        "name": "155-集合框架-List接口常用方法的测试"
    },
    {
        "time": "0.42:50",
        "name": "156-集合框架-List不同实现类的对比及课后练习"
    },
    {
        "time": "0.39:58",
        "name": "157-集合框架-Set不同实现类的对比及Set无序性、不可重复性的剖析"
    },
    {
        "time": "0.48:43",
        "name": "158-集合框架-TreeSet的使用与Set接口课后练习"
    },
    {
        "time": "0.32:14",
        "name": "159-集合框架-Map不同实现类的对比与HashMap中元素的特点"
    },
    {
        "time": "0.26:30",
        "name": "160-集合框架-Map接口常用方法的测试"
    },
    {
        "time": "0.59:23",
        "name": "161-集合框架-TreeMap、Properties的使用及Map练习"
    },
    {
        "time": "0.40:35",
        "name": "162-集合框架-Collections工具类的使用"
    },
    {
        "time": "0.36:47",
        "name": "163-集合框架-第12章复习与企业真题"
    },
    {
        "time": "0.57:39",
        "name": "164-泛型-泛型的理解及其在集合、比较器中的使用"
    },
    {
        "time": "0.53:03",
        "name": "165-泛型-自定义泛型类、泛型方法"
    },
    {
        "time": "0.43:36",
        "name": "166-泛型-泛型的应用举例及练习1-3"
    },
    {
        "time": "0.57:08",
        "name": "167-泛型-泛型在继承上的体现及通配符的使用_第13章复习与企业真题"
    },
    {
        "time": "1:07:29",
        "name": "168-数据结构与集合源码-数据结构概述与手写线性表、二叉树"
    },
    {
        "time": "0.24:48",
        "name": "169-数据结构与集合源码-ArrayList在JDK7和JDK8中的源码剖析"
    },
    {
        "time": "0.23:51",
        "name": "170-数据结构与集合源码-Vector、LinkedList在JDK8中的源码剖析"
    },
    {
        "time": "0.59:09",
        "name": "171-数据结构与集合源码-HashMap在JDK7中的源码剖析"
    },
    {
        "time": "0.34:58",
        "name": "172-数据结构与集合源码-HashMap在JDK8中的源码剖析"
    },
    {
        "time": "0.22:16",
        "name": "173-数据结构与集合源码-LinkedHashMap、HashSet、LinkedHashSet的源码剖析"
    },
    {
        "time": "0.51:05",
        "name": "174-数据结构与集合源码-第14章复习与企业真题"
    },
    {
        "time": "1:13:11",
        "name": "175-File类与IO流-File类的实例化与常用方法_File练习1-3"
    },
    {
        "time": "0.19:51",
        "name": "176-File类与IO流-IO流概述与流的分类"
    },
    {
        "time": "0.47:27",
        "name": "177-File类与IO流-使用FileReader和FileWriter读取、写出文本数据"
    },
    {
        "time": "0.35:35",
        "name": "178-File类与IO流-FileInputStream和FileOutputStream的使用"
    },
    {
        "time": "0.44:52",
        "name": "179-File类与IO流-处理流之1：缓冲流的使用"
    },
    {
        "time": "0.54:33",
        "name": "180-File类与IO流-处理流之2：转换流的使用及各种字符集的讲解"
    },
    {
        "time": "0.51:52",
        "name": "181-File类与IO流-处理流之3：对象流的使用及对象的序列化机制"
    },
    {
        "time": "0.52:06",
        "name": "182-File类与IO流-其它流的使用_第15章复习与企业真题"
    },
    {
        "time": "0.59:06",
        "name": "183-网络编程-网络编程三要素与InetAddress类的使用"
    },
    {
        "time": "1:07:24",
        "name": "184-网络编程-TCP与UDP协议剖析与TCP编程案例1-3"
    },
    {
        "time": "0.22:35",
        "name": "185-网络编程-聊天室代码实现的说明与演示"
    },
    {
        "time": "0.58:41",
        "name": "186-网络编程-UDP、URL网络编程及第16章复习与企业真题"
    },
    {
        "time": "0.41:05",
        "name": "187-反射机制-反射的理解与使用举例"
    },
    {
        "time": "0.30:26",
        "name": "188-反射机制-反射、Class的理解与获取Class实例的方式"
    },
    {
        "time": "0.53:51",
        "name": "189-反射机制-类的加载过程与类加载器的理解"
    },
    {
        "time": "0.50:35",
        "name": "190-反射机制-反射的应用：创建运行时类的对象、获取运行时类的完整结构"
    },
    {
        "time": "0.36:05",
        "name": "191-反射机制-反射的应用：调用指定的属性、方法、构造器"
    },
    {
        "time": "0.39:06",
        "name": "192-反射机制-反射的应用：获取指定的注解_反射的动态性举例"
    },
    {
        "time": "0.36:56",
        "name": "193-反射机制-第17章复习与企业真题"
    },
    {
        "time": "0.25:27",
        "name": "194-JDK8-17新特性-新特性的概述_如何学习新特性"
    },
    {
        "time": "0.46:27",
        "name": "195-JDK8-17新特性-lambda表达式的使用与函数式接口的理解"
    },
    {
        "time": "0.55:20",
        "name": "196-JDK8-17新特性-方法引用与构造器引用"
    },
    {
        "time": "1:20:20",
        "name": "197-JDK8-17新特性-StreamAPI使用三环节：实例化、中间操作、终止操作"
    },
    {
        "time": "0.32:10",
        "name": "198-JDK8-17新特性-JDK8之后的语法新特性汇总1"
    },
    {
        "time": "1:08:01",
        "name": "199-JDK8-17新特性-JDK8之后的语法新特性汇总2及API层面变化"
    },
    {
        "time": "0.24:42",
        "name": "200-JDK8-17新特性-第18章复习与企业真题_最后寄语"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data
