var data = [
    {
        "time": "0.09:08",
        "name": "01-MySQL教程简介"
    },
    {
        "time": "0.16:03",
        "name": "02-为什么使用数据库及数据库常用概念"
    },
    {
        "time": "0.18:48",
        "name": "03-常见的DBMS的对比"
    },
    {
        "time": "0.20:05",
        "name": "04-RDBMS和非RDBMS的对比"
    },
    {
        "time": "0.20:33",
        "name": "05-ER模型与表记录的4种关系"
    },
    {
        "time": "0.20:41",
        "name": "06-MySQL8.0的卸载"
    },
    {
        "time": "0.35:30",
        "name": "07-MySQL8.0与5.7版本的下载、安装与配置"
    },
    {
        "time": "0.19:19",
        "name": "08-MySQL安装常见问题_服务启动与用户登录"
    },
    {
        "time": "0.27:53",
        "name": "09-MySQL的使用演示_MySQL5.7字符集的设置"
    },
    {
        "time": "0.29:00",
        "name": "10-Navicat_SQLyog_dbeaver等工具的使用"
    },
    {
        "time": "0.33:56",
        "name": "11-MySQL目录结构及前2章课后练习"
    },
    {
        "time": "0.34:30",
        "name": "12-SQL概述与SQL分类"
    },
    {
        "time": "0.32:02",
        "name": "13-SQL使用规范与数据的导入"
    },
    {
        "time": "0.09:02",
        "name": "14-最基本的SELECT...FROM结构"
    },
    {
        "time": "0.33:19",
        "name": "15-列的别名_去重_NULL_DESC等操作"
    },
    {
        "time": "0.10:07",
        "name": "16-使用WHERE过滤数据"
    },
    {
        "time": "0.09:35",
        "name": "17-第3章基本SELECT查询课后练习"
    },
    {
        "time": "0.17:05",
        "name": "18-算术运算符的使用"
    },
    {
        "time": "0.58:02",
        "name": "19-比较运算符的使用"
    },
    {
        "time": "0.22:58",
        "name": "20-逻辑运算符与位运算符的使用"
    },
    {
        "time": "0.17:27",
        "name": "21-第4章运算符课后练习"
    },
    {
        "time": "0.21:33",
        "name": "22-ORDER BY实现排序操作"
    },
    {
        "time": "0.30:54",
        "name": "23-LIMIT实现分页操作"
    },
    {
        "time": "0.10:49",
        "name": "24-第5章排序与分页课后练习"
    },
    {
        "time": "0.22:14",
        "name": "25-为什么需要多表的查询"
    },
    {
        "time": "0.35:43",
        "name": "26-笛卡尔积的错误与正确的多表查询"
    },
    {
        "time": "0.16:34",
        "name": "27-等值连接vs非等值连接、自连接vs非自连接"
    },
    {
        "time": "0.35:55",
        "name": "28-SQL92与99语法如何实现内连接和外连接"
    },
    {
        "time": "0.21:40",
        "name": "29-使用SQL99实现7种JOIN操作"
    },
    {
        "time": "0.10:55",
        "name": "30-NATURAL JOIN与USING的使用"
    },
    {
        "time": "0.34:32",
        "name": "31-第6章多表查询课后练习"
    },
    {
        "time": "0.12:46",
        "name": "32-函数的分类"
    },
    {
        "time": "0.36:11",
        "name": "33-数值类型的函数讲解"
    },
    {
        "time": "0.31:00",
        "name": "34-字符串类型的函数讲解"
    },
    {
        "time": "0.52:37",
        "name": "35-日期时间类型的函数讲解"
    },
    {
        "time": "0.21:43",
        "name": "36-流程控制函数讲解"
    },
    {
        "time": "0.25:06",
        "name": "37-加密解密_MySQL信息函数等讲解"
    },
    {
        "time": "0.29:03",
        "name": "38-第7章单行函数课后练习"
    },
    {
        "time": "0.43:08",
        "name": "39-5大常用的聚合函数"
    },
    {
        "time": "0.31:30",
        "name": "40-GROUP BY的使用"
    },
    {
        "time": "0.44:01",
        "name": "41-HAVING的使用与SQL语句执行过程"
    },
    {
        "time": "0.19:04",
        "name": "42-第8章聚合函数课后练习"
    },
    {
        "time": "0.27:26",
        "name": "43-子查询举例与子查询的分类"
    },
    {
        "time": "0.29:19",
        "name": "44-单行子查询案例分析"
    },
    {
        "time": "0.25:15",
        "name": "45-多行子查询案例分析"
    },
    {
        "time": "0.45:58",
        "name": "46-相关子查询案例分析"
    },
    {
        "time": "0.40:17",
        "name": "47-第9章子查询课后练习1"
    },
    {
        "time": "0.48:29",
        "name": "48-第9章子查询课后练习2"
    },
    {
        "time": "0.37:55",
        "name": "49-数据库的创建、修改与删除"
    },
    {
        "time": "0.30:19",
        "name": "50-常见的数据类型_创建表的两种方式"
    },
    {
        "time": "0.22:53",
        "name": "51-修改表_重命名表_删除表_清空表"
    },
    {
        "time": "0.21:59",
        "name": "52-DCL中COMMIT与ROLLBACK的使用"
    },
    {
        "time": "0.20:29",
        "name": "53-阿里MySQL命名规范及MySQL8DDL的原子化"
    },
    {
        "time": "0.38:37",
        "name": "54-第10章创建管理表课后练习"
    },
    {
        "time": "0.26:29",
        "name": "55-DML之添加数据"
    },
    {
        "time": "0.20:41",
        "name": "56-DML之更新删除操作_MySQL8新特性之计算列"
    },
    {
        "time": "0.36:50",
        "name": "57-DDL和DML的综合案例"
    },
    {
        "time": "0.37:20",
        "name": "58-第11章增删改课后练习"
    },
    {
        "time": "0.23:20",
        "name": "59-MySQL数据类型概述_字符集设置"
    },
    {
        "time": "0.25:23",
        "name": "60-整型数据类型讲解"
    },
    {
        "time": "0.36:30",
        "name": "61-浮点数、定点数与位类型讲解"
    },
    {
        "time": "0.37:53",
        "name": "62-日期时间类型讲解"
    },
    {
        "time": "0.35:19",
        "name": "63-文本字符串类型（含ENUM、SET）讲解"
    },
    {
        "time": "0.24:13",
        "name": "64-二进制类型与JSON类型讲解"
    },
    {
        "time": "0.06:14",
        "name": "65-小结及类型使用建议"
    },
    {
        "time": "0.17:28",
        "name": "66-数据完整性与约束的分类"
    },
    {
        "time": "0.15:31",
        "name": "67-非空约束的使用"
    },
    {
        "time": "0.35:46",
        "name": "68-唯一性约束的使用"
    },
    {
        "time": "0.21:47",
        "name": "69-主键约束的使用"
    },
    {
        "time": "0.21:17",
        "name": "70-AUTO_INCREMENT"
    },
    {
        "time": "0.42:02",
        "name": "71-外键约束的使用"
    },
    {
        "time": "0.20:23",
        "name": "72-检查约束与默认值约束"
    },
    {
        "time": "0.33:25",
        "name": "73-第13章约束课后练习"
    },
    {
        "time": "0.25:55",
        "name": "74-数据库对象与视图的理解"
    },
    {
        "time": "0.26:13",
        "name": "75-视图的创建与查看"
    },
    {
        "time": "0.25:02",
        "name": "76-更新视图数据与视图的删除"
    },
    {
        "time": "0.17:09",
        "name": "77-第14章视图课后练习"
    },
    {
        "time": "0.19:21",
        "name": "78-存储过程使用说明"
    },
    {
        "time": "0.33:02",
        "name": "79-存储过程的创建与调用"
    },
    {
        "time": "0.23:31",
        "name": "80-存储函数的创建与调用"
    },
    {
        "time": "0.25:46",
        "name": "81-存储过程与函数的查看修改和删除"
    },
    {
        "time": "0.42:35",
        "name": "82-第15章存储过程函数课后练习"
    },
    {
        "time": "0.34:42",
        "name": "83-GLOBAL与SESSION系统变量的使用"
    },
    {
        "time": "0.42:16",
        "name": "84-会话用户变量与局部变量的使用"
    },
    {
        "time": "0.41:16",
        "name": "85-程序出错的处理机制"
    },
    {
        "time": "0.35:16",
        "name": "86-分支结构IF的使用"
    },
    {
        "time": "0.27:01",
        "name": "87-分支结构CASE的使用"
    },
    {
        "time": "0.51:48",
        "name": "88-LOOP_WHILE_REPEAT三种循环结构"
    },
    {
        "time": "0.28:43",
        "name": "89-LEAVE和ITERATE的使用"
    },
    {
        "time": "0.29:08",
        "name": "90-游标的使用"
    },
    {
        "time": "0.58:56",
        "name": "91-第16章课后练习"
    },
    {
        "time": "0.38:14",
        "name": "92-创建触发器"
    },
    {
        "time": "0.31:29",
        "name": "93-查看删除触发器_触发器课后练习"
    },
    {
        "time": "1:13:01",
        "name": "94-MySQL8.0新特性_窗口函数的使用"
    },
    {
        "time": "0.35:13",
        "name": "95-公用表表达式_课后练习_最后寄语"
    },
    {
        "time": "0.19:13",
        "name": "96-MySQL高级特性篇章节概览"
    },
    {
        "time": "0.22:27",
        "name": "97-CentOS环境的准备"
    },
    {
        "time": "0.11:13",
        "name": "98-MySQL的卸载"
    },
    {
        "time": "0.26:00",
        "name": "99-Linux下安装MySQL8.0与5.7版本"
    },
    {
        "time": "0.26:18",
        "name": "100-SQLyog实现MySQL8.0和5.7的远程连接"
    },
    {
        "time": "0.26:41",
        "name": "101-字符集的修改与底层原理说明"
    },
    {
        "time": "0.21:27",
        "name": "102-比较规则_请求到响应过程中的编码与解码过程"
    },
    {
        "time": "0.24:07",
        "name": "103-SQL大小写规范与sql_mode的设置"
    },
    {
        "time": "0.34:49",
        "name": "104-MySQL目录结构与表在文件系统中的表示"
    },
    {
        "time": "0.22:29",
        "name": "105-用户的创建_修改_删除"
    },
    {
        "time": "0.14:43",
        "name": "106-用户密码的设置和管理"
    },
    {
        "time": "0.38:31",
        "name": "107-权限管理与访问控制"
    },
    {
        "time": "0.24:03",
        "name": "108-角色的使用"
    },
    {
        "time": "0.35:17",
        "name": "109-配置文件、系统变量与MySQL逻辑架构"
    },
    {
        "time": "0.21:31",
        "name": "110-SQL执行流程"
    },
    {
        "time": "0.16:17",
        "name": "111-MySQL8.0和5.7中SQL执行流程的演示"
    },
    {
        "time": "0.22:29",
        "name": "112-Oracle中SQL执行流程_缓冲池的使用"
    },
    {
        "time": "0.32:44",
        "name": "113-设置表的存储引擎、InnoDB与MyISAM的对比"
    },
    {
        "time": "0.15:44",
        "name": "114-Archive、CSV、Memory等存储引擎的使用"
    },
    {
        "time": "0.24:17",
        "name": "115-为什么使用索引及索引的优缺点"
    },
    {
        "time": "0.22:23",
        "name": "116-一个简单的索引设计方案"
    },
    {
        "time": "0.18:52",
        "name": "117-索引的迭代设计方案"
    },
    {
        "time": "0.23:25",
        "name": "118-聚簇索引、二级索引与联合索引的概念"
    },
    {
        "time": "0.25:23",
        "name": "119-InnoDB中B+树注意事项_MyISAM的索引方案"
    },
    {
        "time": "0.41:21",
        "name": "120-Hash索引、AVL树、B树与B+树对比"
    },
    {
        "time": "0.20:24",
        "name": "121-InnoDB数据存储结构概述"
    },
    {
        "time": "0.17:53",
        "name": "122-页结构之文件头部与文件尾部"
    },
    {
        "time": "0.24:11",
        "name": "123-页结构之最小最大记录_行格式之记录头信息"
    },
    {
        "time": "0.17:50",
        "name": "124-页结构之页目录与页头"
    },
    {
        "time": "0.30:47",
        "name": "125-设置行格式与ibd文件剖析Compact行格式"
    },
    {
        "time": "0.17:18",
        "name": "126-行溢出与Dynamic、Compressed、Redundant行格式"
    },
    {
        "time": "0.36:29",
        "name": "127-区、段、碎片区与表空间结构"
    },
    {
        "time": "0.11:34",
        "name": "128-索引的分类"
    },
    {
        "time": "0.38:53",
        "name": "129-表中添加索引的三种方式"
    },
    {
        "time": "0.32:14",
        "name": "130-删除索引与索引新特性：降序索引、隐藏索引"
    },
    {
        "time": "0.35:23",
        "name": "131-适合创建索引的11种情况1"
    },
    {
        "time": "0.24:45",
        "name": "132-适合创建索引的11种情况2"
    },
    {
        "time": "0.09:58",
        "name": "133-不适合创建索引的7种情况"
    },
    {
        "time": "0.17:57",
        "name": "134-数据库优化步骤_查看系统性能参数"
    },
    {
        "time": "0.26:01",
        "name": "135-慢查询日志分析、SHOW PROFILE查看SQL执行成本"
    },
    {
        "time": "0.31:28",
        "name": "136-EXPLAIN的概述与table、id字段剖析"
    },
    {
        "time": "0.39:58",
        "name": "137-EXPLAIN中select_type、partitions、type、possible_keys、key、key_len剖析"
    },
    {
        "time": "0.30:05",
        "name": "138-EXPLAIN中ref、rows、filtered、extra剖析"
    },
    {
        "time": "0.19:11",
        "name": "139-EXPLAIN的4种格式与查看优化器重写SQL"
    },
    {
        "time": "0.10:22",
        "name": "140-trace分析优化器执行计划与Sys schema视图的使用"
    },
    {
        "time": "0.41:24",
        "name": "141-数据准备与索引失效的11种情况1"
    },
    {
        "time": "0.19:30",
        "name": "142-索引失效的11种情况2"
    },
    {
        "time": "0.19:45",
        "name": "143-外连接与内连接的查询优化"
    },
    {
        "time": "0.27:57",
        "name": "144-JOIN语句的底层原理"
    },
    {
        "time": "0.42:13",
        "name": "145-子查询优化与排序优化"
    },
    {
        "time": "0.06:04",
        "name": "146-GROUP BY优化、分页查询优化"
    },
    {
        "time": "0.21:58",
        "name": "147-覆盖索引的使用"
    },
    {
        "time": "0.18:28",
        "name": "148-索引条件下推(ICP)"
    },
    {
        "time": "0.12:52",
        "name": "149-其他查询优化策略"
    },
    {
        "time": "0.26:39",
        "name": "150-淘宝数据库的主键如何设计"
    },
    {
        "time": "0.21:43",
        "name": "151-范式概述与第一范式"
    },
    {
        "time": "0.25:45",
        "name": "152-第二范式与第三范式"
    },
    {
        "time": "0.23:24",
        "name": "153-反范式化的应用"
    },
    {
        "time": "0.18:21",
        "name": "154-巴斯范式、第四范式、第五范式和域键范式"
    },
    {
        "time": "0.18:38",
        "name": "155-范式的实战案例"
    },
    {
        "time": "0.25:35",
        "name": "156-ER建模与转换数据表的过程"
    },
    {
        "time": "0.15:31",
        "name": "157-数据库的设计原则和日常SQL编写规范"
    },
    {
        "time": "0.36:56",
        "name": "158-PowerDesigner创建概念、物理数据模型"
    },
    {
        "time": "0.28:47",
        "name": "159-数据库调优整体步骤、优化MySQL服务器硬件和参数"
    },
    {
        "time": "0.41:30",
        "name": "160-数据库结构优化、大表优化、其它3个策略"
    },
    {
        "time": "0.27:59",
        "name": "161-事务的ACID特性与事务的状态"
    },
    {
        "time": "0.19:52",
        "name": "162-显式事务与隐式事务"
    },
    {
        "time": "0.25:21",
        "name": "163-事务的使用举例"
    },
    {
        "time": "0.19:50",
        "name": "164-数据并发问题与4种隔离级别"
    },
    {
        "time": "0.12:13",
        "name": "165-MySQL隔离级别的查看和设置"
    },
    {
        "time": "0.13:24",
        "name": "166-读未提交隔离性下的演示"
    },
    {
        "time": "0.09:28",
        "name": "167-读已提交和可重复读的隔离性下的演示"
    },
    {
        "time": "0.12:19",
        "name": "168-幻读的演示与解决方案"
    },
    {
        "time": "0.20:31",
        "name": "169-Redo日志和Undo日志的理解、为什么需要Redo日志"
    },
    {
        "time": "0.28:13",
        "name": "170-Redo日志的刷盘策略与过程剖析"
    },
    {
        "time": "0.19:50",
        "name": "171-写入Redo Log Buffer和Redo Log File的写入策略"
    },
    {
        "time": "0.32:05",
        "name": "172-Undo日志的概述与写入过程"
    },
    {
        "time": "0.21:36",
        "name": "173-锁的概述_读写的并发问题"
    },
    {
        "time": "0.21:47",
        "name": "174-数据操作类型的角度理解S锁与X锁"
    },
    {
        "time": "0.34:04",
        "name": "175-表锁之S锁、X锁、意向锁"
    },
    {
        "time": "0.14:51",
        "name": "176-表锁之自增锁、元数据锁"
    },
    {
        "time": "0.27:00",
        "name": "177-行锁之记录锁、间隙锁"
    },
    {
        "time": "0.14:24",
        "name": "178-行锁之临键锁与插入意向锁"
    },
    {
        "time": "0.19:34",
        "name": "179-页锁的理解、乐观锁与悲观锁的使用"
    },
    {
        "time": "0.16:07",
        "name": "180-加锁方式划分：隐式锁与显式锁"
    },
    {
        "time": "0.18:26",
        "name": "181-全局锁与死锁的理解"
    },
    {
        "time": "0.20:21",
        "name": "182-锁的内存结构与监控策略"
    },
    {
        "time": "0.10:57",
        "name": "183-MVCC解决读写问题"
    },
    {
        "time": "0.26:26",
        "name": "184-MVCC三剑客：隐藏字段、UndoLog版本链、ReadView规则"
    },
    {
        "time": "0.11:48",
        "name": "185-MVCC在读已提交和可重复读隔离级别下的操作流程"
    },
    {
        "time": "0.07:42",
        "name": "186-MVCC在可重复读下解决幻读的流程"
    },
    {
        "time": "0.12:09",
        "name": "187-六大日志文件的概述"
    },
    {
        "time": "0.20:03",
        "name": "188-通用查询日志、错误日志"
    },
    {
        "time": "0.43:59",
        "name": "189-binlog日志的参数设置与实现数据恢复演示"
    },
    {
        "time": "0.21:45",
        "name": "190-binlog的删除、binlog的写入机制与两阶段提交"
    },
    {
        "time": "0.26:47",
        "name": "191-中继日志、主从复制的步骤与原理剖析"
    },
    {
        "time": "0.34:57",
        "name": "192-一主一从架构搭建与主从同步的实现"
    },
    {
        "time": "0.11:50",
        "name": "193-binlog的format设置说明"
    },
    {
        "time": "0.14:18",
        "name": "194-数据同步一致性问题解决"
    },
    {
        "time": "0.30:07",
        "name": "195-数据备份概述与mysqldump实现逻辑备份数据"
    },
    {
        "time": "0.18:07",
        "name": "196-演示mysql实现逻辑恢复数据"
    },
    {
        "time": "0.24:13",
        "name": "197-物理备份和物理恢复的演示、表数据的导出与导入"
    },
    {
        "time": "0.18:11",
        "name": "198-数据库迁移与如何删库不跑路"
    },
    {
        "time": "0.08:48",
        "name": "199-最后寄语"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data
