var data = [
    {
        "time": "0.05:55",
        "name": "001-课程简介_ev"
    },
    {
        "time": "0.09:05",
        "name": "002-Maven 概述-第一节 Why Maven-依赖角度_ev"
    },
    {
        "time": "0.12:02",
        "name": "003-Maven 概述-第一节 Why Maven-构建角度_ev"
    },
    {
        "time": "0.08:44",
        "name": "004-Maven 概述-第二节 What is Maven-构建的概念_ev"
    },
    {
        "time": "0.01:44",
        "name": "005-Maven 概述-第二节 What is Maven-依赖的概念_ev"
    },
    {
        "time": "0.02:40",
        "name": "006-Maven 概述-第二节 What is Maven-总体工作机制_ev"
    },
    {
        "time": "0.04:23",
        "name": "007-Maven 安装-第一节 核心程序-下载_ev"
    },
    {
        "time": "0.02:22",
        "name": "008-Maven 安装-第一节 核心程序-解压_ev"
    },
    {
        "time": "0.04:40",
        "name": "009-Maven 安装-第一节 核心程序-配置-本地仓库_ev"
    },
    {
        "time": "0.04:59",
        "name": "010-Maven 安装-第一节 核心程序-配置-镜像仓库_ev"
    },
    {
        "time": "0.01:39",
        "name": "011-Maven 安装-第一节 核心程序-配置-JDK版本_ev"
    },
    {
        "time": "0.01:37",
        "name": "012-Maven 安装-第二节 环境变量-确认正确安装JDK_ev"
    },
    {
        "time": "0.03:06",
        "name": "013-Maven 安装-第二节 环境变量-配置MAVEN_HOME和PATH_ev"
    },
    {
        "time": "0.06:54",
        "name": "014-Maven 命令行-实验一-核心概念：坐标_ev"
    },
    {
        "time": "0.02:18",
        "name": "015-Maven 命令行-实验一-坐标和仓库目录的对应关系_ev"
    },
    {
        "time": "0.07:14",
        "name": "016-Maven 命令行-实验一-archetype命令说明_ev"
    },
    {
        "time": "0.06:42",
        "name": "017-Maven 命令行-实验一-执行命令创建工程_ev"
    },
    {
        "time": "0.02:15",
        "name": "018-Maven 命令行-实验一-对创建好的工程做一点调整_ev"
    },
    {
        "time": "0.12:36",
        "name": "019-Maven 命令行-实验一-pom.xml解读_ev"
    },
    {
        "time": "0.03:55",
        "name": "020-Maven 命令行-实验一-核心概念：POM_ev"
    },
    {
        "time": "0.07:07",
        "name": "021-Maven 命令行-实验一-核心概念：约定的目录结构_ev"
    },
    {
        "time": "0.05:08",
        "name": "022-Maven 命令行-实验二-添加 Java 代码_ev"
    },
    {
        "time": "0.05:58",
        "name": "023-Maven 命令行-实验三-clean 和 compile 命令_ev"
    },
    {
        "time": "0.05:28",
        "name": "024-Maven 命令行-实验三-test 命令_ev"
    },
    {
        "time": "0.03:26",
        "name": "025-Maven 命令行-实验三-package 命令_ev"
    },
    {
        "time": "0.05:23",
        "name": "026-Maven 命令行-实验三-install 命令_ev"
    },
    {
        "time": "0.06:47",
        "name": "027-Maven 命令行-实验四-生成 Web 工程-执行生成_ev"
    },
    {
        "time": "0.09:47",
        "name": "028-Maven 命令行-实验四-生成 Web 工程-执行构建_ev"
    },
    {
        "time": "0.02:47",
        "name": "029-Maven 命令行-实验四-生成 Web 工程-执行部署_ev"
    },
    {
        "time": "0.11:49",
        "name": "030-Maven 命令行-实验五-针对 Web 工程执行构建命令_ev"
    },
    {
        "time": "0.13:44",
        "name": "031-Maven 命令行-实验六-依赖范围-测试 compile 范围-空间角度_ev"
    },
    {
        "time": "0.05:15",
        "name": "032-Maven 命令行-实验六-依赖范围-测试 compile 范围-时间角度_ev"
    },
    {
        "time": "0.09:57",
        "name": "033-Maven 命令行-实验六-依赖范围-测试 test 范围_ev"
    },
    {
        "time": "0.11:49",
        "name": "034-Maven 命令行-实验六-依赖范围-测试 provided 范围_ev"
    },
    {
        "time": "0.17:27",
        "name": "035-Maven 命令行-实验七-依赖传递性_ev"
    },
    {
        "time": "0.10:29",
        "name": "036-Maven 命令行-实验八-依赖的排除_ev"
    },
    {
        "time": "0.04:39",
        "name": "037-Maven 命令行-实验九-继承-概述_ev"
    },
    {
        "time": "0.10:47",
        "name": "038-Maven 命令行-实验九-继承-创建父子工程_ev"
    },
    {
        "time": "0.12:37",
        "name": "039-Maven 命令行-实验九-继承-在父工程管理依赖_ev"
    },
    {
        "time": "0.02:52",
        "name": "040-Maven 命令行-实验九-继承-在父工程修改依赖版本_ev"
    },
    {
        "time": "0.06:04",
        "name": "041-Maven 命令行-实验九-继承-配置自定义属性_ev"
    },
    {
        "time": "0.03:16",
        "name": "042-Maven 命令行-实验九-继承-实践意义_ev"
    },
    {
        "time": "0.07:27",
        "name": "043-Maven 命令行-实验十-聚合_ev"
    },
    {
        "time": "0.09:10",
        "name": "044-Maven IDEA-创建父工程并初步配置_ev"
    },
    {
        "time": "0.05:32",
        "name": "045-Maven IDEA-创建 Java module_ev"
    },
    {
        "time": "0.08:17",
        "name": "046-Maven IDEA-三种方式执行 Maven 命令_ev"
    },
    {
        "time": "0.09:11",
        "name": "047-Maven IDEA-创建 Web module_ev"
    },
    {
        "time": "0.08:52",
        "name": "048-Maven IDEA-导入 project_ev"
    },
    {
        "time": "0.05:24",
        "name": "049-Maven IDEA-导入 module-Java module_ev"
    },
    {
        "time": "0.04:05",
        "name": "050-Maven IDEA-导入 module-Web module_ev"
    },
    {
        "time": "0.09:44",
        "name": "051-Maven 其它核心概念-生命周期_ev"
    },
    {
        "time": "0.04:31",
        "name": "052-Maven 其它核心概念-插件和目标_ev"
    },
    {
        "time": "0.05:31",
        "name": "053-Maven 其它核心概念-仓库_ev"
    },
    {
        "time": "0.03:34",
        "name": "054-单一架构案例-功能演示_ev"
    },
    {
        "time": "0.03:32",
        "name": "055-单一架构案例-创建工程-架构的概念_ev"
    },
    {
        "time": "0.03:09",
        "name": "056-单一架构案例-创建工程-正式创建_ev"
    },
    {
        "time": "0.19:52",
        "name": "057-单一架构案例-引入依赖-如何选择依赖_ev"
    },
    {
        "time": "0.05:54",
        "name": "058-单一架构案例-引入依赖-组建依赖列表_ev"
    },
    {
        "time": "0.09:08",
        "name": "059-单一架构案例-建包_ev"
    },
    {
        "time": "0.10:42",
        "name": "060-单一架构案例-搭建环境-持久化层-物理建模_ev"
    },
    {
        "time": "0.03:24",
        "name": "061-单一架构案例-搭建环境-持久化层-逻辑建模_ev"
    },
    {
        "time": "0.02:59",
        "name": "062-单一架构案例-搭建环境-持久化层-数据库连接信息_ev"
    },
    {
        "time": "0.14:33",
        "name": "063-单一架构案例-搭建环境-持久化层-JDBCUtils-创建数据源对象_ev"
    },
    {
        "time": "0.11:17",
        "name": "064-单一架构案例-搭建环境-持久化层-JDBCUtils-事务代码分析_ev"
    },
    {
        "time": "0.09:16",
        "name": "065-单一架构案例-搭建环境-持久化层-JDBCUtils-对象跨方法传递分析_ev"
    },
    {
        "time": "0.10:13",
        "name": "066-单一架构案例-搭建环境-持久化层-JDBCUtils-ThreadLocal介绍_ev"
    },
    {
        "time": "0.07:44",
        "name": "067-单一架构案例-搭建环境-持久化层-JDBCUtils-工具方法实现_ev"
    },
    {
        "time": "0.05:29",
        "name": "068-单一架构案例-搭建环境-持久化层-JDBCUtils-测试_ev"
    },
    {
        "time": "0.13:13",
        "name": "069-单一架构案例-搭建环境-持久化层-BaseDao-泛型说明_ev"
    },
    {
        "time": "0.06:33",
        "name": "070-单一架构案例-搭建环境-持久化层-BaseDao-具体方法_ev"
    },
    {
        "time": "0.09:19",
        "name": "071-单一架构案例-搭建环境-持久化层-BaseDao-测试_ev"
    },
    {
        "time": "0.02:15",
        "name": "072-单一架构案例-搭建环境-持久化层-子类Dao_ev"
    },
    {
        "time": "0.02:36",
        "name": "073-单一架构案例-搭建环境-事务控制-总体思路_ev"
    },
    {
        "time": "0.10:02",
        "name": "074-单一架构案例-搭建环境-事务控制-事务过滤器_ev"
    },
    {
        "time": "0.05:11",
        "name": "075-单一架构案例-搭建环境-事务控制-TransactionFilter类_ev"
    },
    {
        "time": "0.03:39",
        "name": "076-单一架构案例-搭建环境-事务控制-注册TransactionFilter类_ev"
    },
    {
        "time": "0.04:21",
        "name": "077-单一架构案例-搭建环境-事务控制-注意点强调_ev"
    },
    {
        "time": "0.04:56",
        "name": "078-单一架构案例-搭建环境-表述层-ViewBaseServlet-服务器端渲染_ev"
    },
    {
        "time": "0.07:11",
        "name": "079-单一架构案例-搭建环境-表述层-ViewBaseServlet-Thymeleaf 简要工作机制_ev"
    },
    {
        "time": "0.04:15",
        "name": "080-单一架构案例-搭建环境-表述层-ViewBaseServlet-逻辑视图的概念_ev"
    },
    {
        "time": "0.08:27",
        "name": "081-单一架构案例-搭建环境-表述层-ViewBaseServlet-创建这个类_ev"
    },
    {
        "time": "0.05:01",
        "name": "082-单一架构案例-搭建环境-表述层-ViewBaseServlet-配置初始化参数_ev"
    },
    {
        "time": "0.09:07",
        "name": "083-单一架构案例-搭建环境-表述层-ModuleBaseServlet_ev"
    },
    {
        "time": "0.03:47",
        "name": "084-单一架构案例-搭建环境-辅助功能_ev"
    },
    {
        "time": "0.09:45",
        "name": "085-单一架构案例-业务功能-显示首页-流程图_ev"
    },
    {
        "time": "0.16:43",
        "name": "086-单一架构案例-业务功能-显示首页-代码实现_ev"
    },
    {
        "time": "0.11:54",
        "name": "087-单一架构案例-业务功能-登录-流程图_ev"
    },
    {
        "time": "0.07:00",
        "name": "088-单一架构案例-业务功能-登录-创建AuthServlet类_ev"
    },
    {
        "time": "0.03:45",
        "name": "089-单一架构案例-业务功能-登录-创建EmpService和登录失败异常_ev"
    },
    {
        "time": "0.06:34",
        "name": "090-单一架构案例-业务功能-登录-AuthServlet 登录逻辑_ev"
    },
    {
        "time": "0.13:20",
        "name": "091-单一架构案例-业务功能-登录-完成并测试_ev"
    },
    {
        "time": "0.06:33",
        "name": "092-单一架构案例-业务功能-登录-退出登录_ev"
    },
    {
        "time": "0.06:15",
        "name": "093-单一架构案例-业务功能-显示奏折列表-流程图_ev"
    },
    {
        "time": "0.06:02",
        "name": "094-单一架构案例-业务功能-显示奏折列表-创建组件_ev"
    },
    {
        "time": "0.10:05",
        "name": "095-单一架构案例-业务功能-显示奏折列表-Java 代码_ev"
    },
    {
        "time": "0.08:17",
        "name": "096-单一架构案例-业务功能-显示奏折列表-页面-登录信息部分_ev"
    },
    {
        "time": "0.08:27",
        "name": "097-单一架构案例-业务功能-显示奏折列表-页面-数据显示部分-初步显示_ev"
    },
    {
        "time": "0.07:05",
        "name": "098-单一架构案例-业务功能-显示奏折列表-页面-数据显示部分-调整颜色_ev"
    },
    {
        "time": "0.02:42",
        "name": "099-单一架构案例-业务功能-显示奏折列表-和登录成功对接_ev"
    },
    {
        "time": "0.08:14",
        "name": "100-单一架构案例-业务功能-显示奏折详情-流程图_ev"
    },
    {
        "time": "0.02:49",
        "name": "101-单一架构案例-业务功能-显示奏折详情-调整超链接_ev"
    },
    {
        "time": "0.06:54",
        "name": "102-单一架构案例-业务功能-显示奏折详情-Java 代码_ev"
    },
    {
        "time": "0.10:34",
        "name": "103-单一架构案例-业务功能-显示奏折详情-页面显示_ev"
    },
    {
        "time": "0.08:35",
        "name": "104-单一架构案例-业务功能-显示奏折详情-奏折已读_ev"
    },
    {
        "time": "0.02:27",
        "name": "105-单一架构案例-业务功能-显示奏折详情-调整表单样式_ev"
    },
    {
        "time": "0.07:53",
        "name": "106-单一架构案例-业务功能-批复奏折_ev"
    },
    {
        "time": "0.06:01",
        "name": "107-单一架构案例-业务功能-登录检查-流程图_ev"
    },
    {
        "time": "0.08:54",
        "name": "108-单一架构案例-业务功能-登录检查-代码实现_ev"
    },
    {
        "time": "0.12:14",
        "name": "109-单一架构案例-打包部署_ev"
    },
    {
        "time": "0.02:49",
        "name": "110-第一只锦囊小结_ev"
    },
    {
        "time": "0.09:07",
        "name": "111-SSM案例-创建工程-建立工程间关系_ev"
    },
    {
        "time": "0.07:29",
        "name": "112-SSM案例-各工程配置 POM_ev"
    },
    {
        "time": "0.09:38",
        "name": "113-SSM案例-持久化层-逆向工程_ev"
    },
    {
        "time": "0.07:53",
        "name": "114-SSM案例-持久化层-配置并测试数据源_ev"
    },
    {
        "time": "0.06:52",
        "name": "115-SSM案例-持久化层-整合Mybatis_ev"
    },
    {
        "time": "0.03:39",
        "name": "116-SSM案例-持久化层-事务控制_ev"
    },
    {
        "time": "0.04:08",
        "name": "117-SSM案例-表述层-配置 web.xml_ev"
    },
    {
        "time": "0.10:45",
        "name": "118-SSM案例-表述层-显示首页_ev"
    },
    {
        "time": "0.03:31",
        "name": "119-SSM案例-辅助功能_ev"
    },
    {
        "time": "0.12:08",
        "name": "120-SSM案例-登录功能_ev"
    },
    {
        "time": "0.07:38",
        "name": "121-SSM案例-登录功能-整理文档_ev"
    },
    {
        "time": "0.04:11",
        "name": "122-第三只锦囊的说明_ev"
    },
    {
        "time": "0.11:21",
        "name": "123-微服务案例-各工程总体说明_ev"
    },
    {
        "time": "0.13:23",
        "name": "124-微服务案例-创建工程、建立依赖关系_ev"
    },
    {
        "time": "0.06:29",
        "name": "125-微服务案例-父工程管理依赖_ev"
    },
    {
        "time": "0.09:41",
        "name": "126-微服务案例-打基础-util 模块_ev"
    },
    {
        "time": "0.02:41",
        "name": "127-微服务案例-打基础-创建实体类_ev"
    },
    {
        "time": "0.09:15",
        "name": "128-微服务案例-对外暴露接口_ev"
    },
    {
        "time": "0.12:13",
        "name": "129-微服务案例-mysql-data-provider-Service 层_ev"
    },
    {
        "time": "0.03:19",
        "name": "130-微服务案例-mysql-data-provider-Controller 层_ev"
    },
    {
        "time": "0.04:43",
        "name": "131-微服务案例-mysql-data-provider-主启动类_ev"
    },
    {
        "time": "0.04:51",
        "name": "132-微服务案例-mysql-data-provider-yml配置文件_ev"
    },
    {
        "time": "0.04:01",
        "name": "133-微服务案例-user-auth-consumer-准备环境_ev"
    },
    {
        "time": "0.03:31",
        "name": "134-微服务案例-user-auth-consumer-显示首页_ev"
    },
    {
        "time": "0.05:17",
        "name": "135-微服务案例-user-auth-consumer-登录验证-流程图_ev"
    },
    {
        "time": "0.11:10",
        "name": "136-微服务案例-user-auth-consumer-登录验证-AuthController-装配远程接口说明_ev"
    },
    {
        "time": "0.05:08",
        "name": "137-微服务案例-user-auth-consumer-登录验证-AuthController-装配远程接口分析_ev"
    },
    {
        "time": "0.07:42",
        "name": "138-微服务案例-user-auth-consumer-登录验证-AuthController-验证方法_ev"
    },
    {
        "time": "0.04:29",
        "name": "139-微服务案例-user-auth-consumer-登录验证-完成并测试_ev"
    },
    {
        "time": "0.04:02",
        "name": "140-微服务案例-部署运行-最终目标_ev"
    },
    {
        "time": "0.04:33",
        "name": "141-微服务案例-部署运行-微服务打包-修改MySQL连接信息_ev"
    },
    {
        "time": "0.07:17",
        "name": "142-微服务案例-部署运行-微服务打包-在总体聚合工程上执行 install_ev"
    },
    {
        "time": "0.07:22",
        "name": "143-微服务案例-部署运行-微服务打包-添加 SpringBoot 的打包插件_ev"
    },
    {
        "time": "0.11:11",
        "name": "144-微服务案例-部署运行-微服务打包-执行 SpringBoot 打包插件的打包命令_ev"
    },
    {
        "time": "0.07:22",
        "name": "145-微服务案例-部署运行-微服务启动_ev"
    },
    {
        "time": "0.03:41",
        "name": "146-POM深入-Maven 是一款项目管理工具_ev"
    },
    {
        "time": "0.08:28",
        "name": "147-POM深入-POM的四层体系_ev"
    },
    {
        "time": "0.12:07",
        "name": "148-POM深入-属性的声明和引用_ev"
    },
    {
        "time": "0.10:09",
        "name": "149-POM深入-build 标签详解-标签本身_ev"
    },
    {
        "time": "0.09:13",
        "name": "150-POM深入-build 标签详解-典型应用：JDK 版本_ev"
    },
    {
        "time": "0.02:52",
        "name": "151-POM深入-build 标签详解-典型应用：SpringBoot 插件和 MBG 插件_ev"
    },
    {
        "time": "0.04:06",
        "name": "152-POM深入-依赖补充-其它三个依赖范围_ev"
    },
    {
        "time": "0.02:12",
        "name": "153-POM深入-依赖补充-可选依赖_ev"
    },
    {
        "time": "0.16:07",
        "name": "154-POM深入-依赖补充-版本仲裁机制_ev"
    },
    {
        "time": "0.06:41",
        "name": "155-POM深入-自定义插件-创建插件_ev"
    },
    {
        "time": "0.09:16",
        "name": "156-POM深入-自定义插件-使用插件_ev"
    },
    {
        "time": "0.05:14",
        "name": "157-POM深入-profile 详解-概述_ev"
    },
    {
        "time": "0.04:24",
        "name": "158-POM深入-profile 详解-配置方式_ev"
    },
    {
        "time": "0.03:52",
        "name": "159-POM深入-profile 详解-激活方式_ev"
    },
    {
        "time": "0.03:39",
        "name": "160-POM深入-profile 详解-实例演示_ev"
    },
    {
        "time": "0.04:40",
        "name": "161-POM深入-profile 详解-资源属性过滤_ev"
    },
    {
        "time": "0.08:16",
        "name": "162-生产实践-搭建Nexus服务器-安装和启动_ev"
    },
    {
        "time": "0.02:29",
        "name": "163-生产实践-搭建Nexus服务器-仓库类型介绍_ev"
    },
    {
        "time": "0.04:22",
        "name": "164-生产实践-对接Nexus服务器-通过Nexus下载第三方jar包_ev"
    },
    {
        "time": "0.13:37",
        "name": "165-生产实践-对接Nexus服务器-部署 jar 包及获取别人部署的 jar 包_ev"
    },
    {
        "time": "0.04:56",
        "name": "166-生产实践-配置Nexus仓库举例_ev"
    },
    {
        "time": "0.06:56",
        "name": "167-生产实践-jar 包冲突-概述_ev"
    },
    {
        "time": "0.03:27",
        "name": "168-生产实践-jar 包冲突-本质_ev"
    },
    {
        "time": "0.02:09",
        "name": "169-生产实践-jar 包冲突-解决办法-概述_ev"
    },
    {
        "time": "0.04:06",
        "name": "170-生产实践-jar 包冲突-解决办法-IDEA 的 Maven helper 插件_ev"
    },
    {
        "time": "0.04:12",
        "name": "171-生产实践-jar 包冲突-解决办法-Maven 的 enforcer 插件_ev"
    },
    {
        "time": "0.12:52",
        "name": "172-生产实践-体系外 jar 包导入_ev"
    },
    {
        "time": "0.06:18",
        "name": "173-导出课件_ev"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data