 
var data = [
    {
        "time": "0.07:43",
        "name": "01、基础入门-SpringBoot2课程介绍"
    },
    {
        "time": "0.21:12",
        "name": "02、基础入门-Spring生态圈"
    },
    {
        "time": "0.11:32",
        "name": "03、基础入门-SpringBoot的大时代背景"
    },
    {
        "time": "0.10:08",
        "name": "04、基础入门-SpringBoot官方文档架构"
    },
    {
        "time": "0.19:14",
        "name": "05、基础入门-SpringBoot-HelloWorld"
    },
    {
        "time": "0.14:10",
        "name": "06、基础入门-SpringBoot-依赖管理特性"
    },
    {
        "time": "0.18:40",
        "name": "07、基础入门-SpringBoot-自动配置特性"
    },
    {
        "time": "0.18:59",
        "name": "08、底层注解-@Configuration详解"
    },
    {
        "time": "0.05:32",
        "name": "09、底层注解-@Import导入组件"
    },
    {
        "time": "0.08:13",
        "name": "10、底层注解-@Conditional条件装配"
    },
    {
        "time": "0.02:37",
        "name": "11、底层注解-@ImportResource导入Spring配置文件"
    },
    {
        "time": "0.09:46",
        "name": "12、底层注解-@ConfigurationProperties配置绑定"
    },
    {
        "time": "0.08:02",
        "name": "13、自动配置【源码分析】-自动包规则原理"
    },
    {
        "time": "0.11:28",
        "name": "14、自动配置【源码分析】-初始加载自动配置类"
    },
    {
        "time": "0.30:40",
        "name": "15、自动配置【源码分析】-自动配置流程"
    },
    {
        "time": "0.09:44",
        "name": "16、最佳实践-SpringBoot应用如何编写"
    },
    {
        "time": "0.07:13",
        "name": "17、最佳实践-Lombok简化开发"
    },
    {
        "time": "0.04:34",
        "name": "18、最佳实践-dev-tools"
    },
    {
        "time": "0.04:52",
        "name": "19、最佳实践-Spring Initailizr"
    },
    {
        "time": "0.30:26",
        "name": "20、配置文件-yaml的用法"
    },
    {
        "time": "0.05:49",
        "name": "21、配置文件-自定义类绑定的配置提示"
    },
    {
        "time": "0.06:36",
        "name": "22、web场景-web开发简介"
    },
    {
        "time": "0.19:54",
        "name": "23、web场景-静态资源规则与定制化"
    },
    {
        "time": "0.10:37",
        "name": "24、web场景-welcome与favicon功能"
    },
    {
        "time": "0.23:53",
        "name": "25、web场景-【源码分析】-静态资源原理"
    },
    {
        "time": "0.21:48",
        "name": "26、请求处理-【源码分析】-Rest映射及源码解析"
    },
    {
        "time": "0.04:34",
        "name": "27、请求处理-【源码分析】-怎么改变默认的_method"
    },
    {
        "time": "0.24:21",
        "name": "28、请求处理-【源码分析】-请求映射原理"
    },
    {
        "time": "0.18:01",
        "name": "29、请求处理-常用参数注解使用"
    },
    {
        "time": "0.05:58",
        "name": "30、请求处理-@RequestAttribute"
    },
    {
        "time": "0.20:57",
        "name": "31、请求处理-@MatrixVariable与UrlPathHelper"
    },
    {
        "time": "0.37:18",
        "name": "32、请求处理-【源码分析】-各种类型参数解析原理"
    },
    {
        "time": "0.06:09",
        "name": "33、请求处理-【源码分析】-Servlet API参数解析原理"
    },
    {
        "time": "0.31:23",
        "name": "34、请求处理-【源码分析】-Model、Map原理"
    },
    {
        "time": "0.37:37",
        "name": "35、请求处理-【源码分析】-自定义参数绑定原理"
    },
    {
        "time": "0.12:02",
        "name": "36、请求处理-【源码分析】-自定义Converter原理"
    },
    {
        "time": "0.23:42",
        "name": "37、响应处理-【源码分析】-ReturnValueHandler原理"
    },
    {
        "time": "0.32:34",
        "name": "38、响应处理-【源码分析】-HTTPMessageConverter原理"
    },
    {
        "time": "0.32:24",
        "name": "39、响应处理-【源码分析】-内容协商原理"
    },
    {
        "time": "0.15:16",
        "name": "40、响应处理-【源码分析】-基于请求参数的内容协商原理"
    },
    {
        "time": "0.23:32",
        "name": "41、响应处理-【源码分析】-自定义MessageConverter"
    },
    {
        "time": "0.19:43",
        "name": "42、响应处理-【源码分析】-浏览器与PostMan内容协商完全适配"
    },
    {
        "time": "0.22:28",
        "name": "43、视图解析-Thymeleaf初体验"
    },
    {
        "time": "0.23:25",
        "name": "44、web实验-后台管理系统基本功能"
    },
    {
        "time": "0.29:39",
        "name": "45、web实验-抽取公共页面"
    },
    {
        "time": "0.11:02",
        "name": "46、web实验-遍历数据与页面bug修改"
    },
    {
        "time": "0.42:48",
        "name": "47、视图解析-【源码分析】-视图解析器与视图"
    },
    {
        "time": "0.19:32",
        "name": "48、拦截器-登录检查与静态资源放行"
    },
    {
        "time": "0.13:29",
        "name": "49、拦截器-【源码分析】-拦截器的执行时机和原理"
    },
    {
        "time": "0.19:25",
        "name": "50、文件上传-单文件与多文件上传的使用"
    },
    {
        "time": "0.18:08",
        "name": "51、文件上传-【源码流程】文件上传参数解析器"
    },
    {
        "time": "0.11:37",
        "name": "52、错误处理-SpringBoot默认错误处理机制"
    },
    {
        "time": "0.23:29",
        "name": "53、错误处理-【源码分析】底层组件功能分析"
    },
    {
        "time": "0.28:03",
        "name": "54、错误处理-【源码流程】异常处理流程"
    },
    {
        "time": "0.39:55",
        "name": "55、错误处理-【源码流程】几种异常处理原理"
    },
    {
        "time": "0.20:18",
        "name": "56、原生组件注入-原生注解与Spring方式注入"
    },
    {
        "time": "0.08:27",
        "name": "57、原生组件注入-【源码分析】DispatcherServlet注入原理"
    },
    {
        "time": "0.27:01",
        "name": "58、嵌入式Servlet容器-【源码分析】切换web服务器与定制化"
    },
    {
        "time": "0.22:20",
        "name": "59、定制化原理-SpringBoot定制化组件的几种方式"
    },
    {
        "time": "0.29:09",
        "name": "60、数据访问-数据库场景的自动配置分析与整合测试"
    },
    {
        "time": "0.28:23",
        "name": "61、数据访问-自定义方式整合druid数据源"
    },
    {
        "time": "0.21:30",
        "name": "62、数据访问-druid数据源starter整合方式"
    },
    {
        "time": "0.30:14",
        "name": "63、数据访问-整合mybatis-配置版"
    },
    {
        "time": "0.18:08",
        "name": "64、数据访问-整合Mybatis-注解配置混合版"
    },
    {
        "time": "0.19:57",
        "name": "65、数据访问-整合MyBatisPlus操作数据库"
    },
    {
        "time": "0.20:47",
        "name": "66、数据访问-crud实验-数据列表展示【补录】"
    },
    {
        "time": "0.08:18",
        "name": "67、数据访问-crud实验-分页数据展示"
    },
    {
        "time": "0.07:03",
        "name": "68、数据访问-crud实验-删除用户完成"
    },
    {
        "time": "0.15:46",
        "name": "69、数据访问-准备阿里云redis环境"
    },
    {
        "time": "0.25:17",
        "name": "70、数据访问-redis操作与统计小实验"
    },
    {
        "time": "0.09:28",
        "name": "71、单元测试-Junit5简介"
    },
    {
        "time": "0.12:40",
        "name": "72、单元测试-常用测试注解"
    },
    {
        "time": "0.20:56",
        "name": "73、单元测试-断言机制"
    },
    {
        "time": "0.04:49",
        "name": "74、单元测试-前置条件"
    },
    {
        "time": "0.08:32",
        "name": "75、单元测试-嵌套测试"
    },
    {
        "time": "0.06:30",
        "name": "76、单元测试-参数化测试"
    },
    {
        "time": "0.20:49",
        "name": "77、指标监控-SpringBoot Actuator与Endpoint"
    },
    {
        "time": "0.11:52",
        "name": "78、指标监控-开启与禁用"
    },
    {
        "time": "0.27:50",
        "name": "79、指标监控-定制Endpoint"
    },
    {
        "time": "0.13:26",
        "name": "80、指标监控-Boot Admin Server"
    },
    {
        "time": "0.25:17",
        "name": "81、高级特性-Profile环境切换"
    },
    {
        "time": "0.21:00",
        "name": "82、高级特性-配置加载优先级"
    },
    {
        "time": "0.21:11",
        "name": "83、高级特性-自定义starter细节"
    },
    {
        "time": "0.13:41",
        "name": "84、原理解析-SpringApplication创建初始化流程"
    },
    {
        "time": "0.41:56",
        "name": "85、原理解析-SpringBoot完整启动过程"
    },
    {
        "time": "0.14:13",
        "name": "86、原理解析-自定义事件监听组件"
    },
    {
        "time": "0.03:20",
        "name": "87、后会有期"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data