 
 
var data = [
    {
        "time": "0.03:20",
        "name": "001-开篇"
    },
    {
        "time": "0.03:08",
        "name": "002-技术选型"
    },
    {
        "time": "0.00:48",
        "name": "003-教学大纲"
    },
    {
        "time": "0.02:40",
        "name": "004-入门-环境准备"
    },
    {
        "time": "0.06:52",
        "name": "005-入门-RESTful & JSON"
    },
    {
        "time": "0.01:17",
        "name": "006-入门-Postman客户端工具"
    },
    {
        "time": "0.05:12",
        "name": "007-入门-倒排索引"
    },
    {
        "time": "0.03:16",
        "name": "008-入门-HTTP-索引-创建"
    },
    {
        "time": "0.02:29",
        "name": "009-入门-HTTP-索引-查询 & 删除"
    },
    {
        "time": "0.05:21",
        "name": "010-入门-HTTP-文档-创建（Put & Post）"
    },
    {
        "time": "0.02:15",
        "name": "011-入门-HTTP-查询-主键查询 & 全查询"
    },
    {
        "time": "0.05:24",
        "name": "012-入门-HTTP-全量修改 & 局部修改 & 删除"
    },
    {
        "time": "0.07:19",
        "name": "013-入门-HTTP-条件查询 & 分页查询 & 查询排序"
    },
    {
        "time": "0.05:16",
        "name": "014-入门-HTTP-多条件查询 & 范围查询"
    },
    {
        "time": "0.04:05",
        "name": "015-入门-HTTP-全文检索 & 完全匹配 & 高亮查询"
    },
    {
        "time": "0.02:52",
        "name": "016-入门-HTTP-聚合查询"
    },
    {
        "time": "0.05:24",
        "name": "017-入门-HTTP-映射关系"
    },
    {
        "time": "0.04:49",
        "name": "018-入门-JavaAPI-环境准备"
    },
    {
        "time": "0.03:59",
        "name": "019-入门-JavaAPI-索引-创建"
    },
    {
        "time": "0.04:37",
        "name": "020-入门-JavaAPI-索引-查询 & 删除"
    },
    {
        "time": "0.08:56",
        "name": "021-入门-JavaAPI-文档-新增 & 修改"
    },
    {
        "time": "0.04:05",
        "name": "022-入门-JavaAPI-文档-查询 & 删除"
    },
    {
        "time": "0.05:20",
        "name": "023-入门-JavaAPI-文档-批量新增 & 批量删除"
    },
    {
        "time": "0.05:24",
        "name": "024-入门-JavaAPI-文档-高级查询-全量查询"
    },
    {
        "time": "0.07:25",
        "name": "025-入门-JavaAPI-文档-高级查询-分页查询 & 条件查询 & 字段查询"
    },
    {
        "time": "0.05:51",
        "name": "026-入门-JavaAPI-文档-高级查询-组合查询 & 范围查询"
    },
    {
        "time": "0.05:28",
        "name": "027-入门-JavaAPI-文档-高级查询-模糊查询 & 高亮查询"
    },
    {
        "time": "0.03:59",
        "name": "028-入门-JavaAPI-文档-高级查询-最大值查询 & 分组查询"
    },
    {
        "time": "0.02:27",
        "name": "029 -环境-简介"
    },
    {
        "time": "0.09:07",
        "name": "030-环境-Windows集群部署"
    },
    {
        "time": "0.07:15",
        "name": "031-环境-Linux单节点部署"
    },
    {
        "time": "0.09:46",
        "name": "032-环境-Linux集群部署"
    },
    {
        "time": "0.07:11",
        "name": "033-进阶-核心概念"
    },
    {
        "time": "0.02:35",
        "name": "034-进阶-系统架构-简介"
    },
    {
        "time": "0.03:59",
        "name": "035-进阶-单节点集群"
    },
    {
        "time": "0.02:09",
        "name": "036-进阶-故障转移"
    },
    {
        "time": "0.04:38",
        "name": "037-进阶-水平扩容"
    },
    {
        "time": "0.02:53",
        "name": "038-进阶-应对故障"
    },
    {
        "time": "0.07:25",
        "name": "039-进阶-路由计算 & 分片控制"
    },
    {
        "time": "0.07:18",
        "name": "040-进阶-数据写流程"
    },
    {
        "time": "0.04:02",
        "name": "041-进阶-数据读流程"
    },
    {
        "time": "0.02:05",
        "name": "042-进阶-更新流程 & 批量操作流程"
    },
    {
        "time": "0.06:46",
        "name": "043-进阶-倒排索引"
    },
    {
        "time": "0.03:24",
        "name": "044-进阶-文档搜索"
    },
    {
        "time": "0.15:54",
        "name": "045-进阶-文档刷新 & 文档刷写 & 文档合并"
    },
    {
        "time": "0.12:01",
        "name": "046-进阶-文档分析"
    },
    {
        "time": "0.08:34",
        "name": "047-进阶-文档控制"
    },
    {
        "time": "0.02:31",
        "name": "048-进阶-文档展示-Kibana"
    },
    {
        "time": "0.02:48",
        "name": "049-框架集成-SpringData-整体介绍"
    },
    {
        "time": "0.08:08",
        "name": "05-框架集成-SpringData-代码功能集成"
    },
    {
        "time": "0.02:49",
        "name": "051-框架集成-SpringData-集成测试-索引操作"
    },
    {
        "time": "0.08:00",
        "name": "052-框架集成-SpringData-集成测试-文档操作"
    },
    {
        "time": "0.03:33",
        "name": "053-框架集成-SpringData-集成测试-文档搜索"
    },
    {
        "time": "0.10:51",
        "name": "054-框架集成-SparkStreaming-集成"
    },
    {
        "time": "0.10:54",
        "name": "055-框架集成-Flink-集成"
    },
    {
        "time": "0.02:17",
        "name": "056-优化-硬件选择"
    },
    {
        "time": "0.05:20",
        "name": "057-优化-分片策略"
    },
    {
        "time": "0.01:06",
        "name": "058-优化-路由选择"
    },
    {
        "time": "0.05:32",
        "name": "059-优化-写入速度优化"
    },
    {
        "time": "0.02:25",
        "name": "060-优化-内存设置"
    },
    {
        "time": "0.02:39",
        "name": "061-优化-重要配置"
    },
    {
        "time": "0.21:45",
        "name": "062-面试题"
    },
    {
        "time": "0.02:56",
        "name": "063-Elasticsearch8.X来了"
    },
    {
        "time": "0.04:15",
        "name": "064-集群环境安装-文件结构说明"
    },
    {
        "time": "0.03:02",
        "name": "065-集群环境安装-生成安全证书"
    },
    {
        "time": "0.02:32",
        "name": "066-集群环境安装-生成HTTP证书"
    },
    {
        "time": "0.04:07",
        "name": "067-集群环境安装-配置第一个节点"
    },
    {
        "time": "0.07:36",
        "name": "068-集群环境安装-配置其他节点"
    },
    {
        "time": "0.03:00",
        "name": "069-集群环境安装-关联问题解决"
    },
    {
        "time": "0.07:54",
        "name": "070-集群环境安装-Kibana软件安装"
    },
    {
        "time": "0.08:15",
        "name": "071-基础功能-索引操作"
    },
    {
        "time": "0.10:30",
        "name": "072-基础功能-文档操作"
    },
    {
        "time": "0.11:32",
        "name": "073-基础功能-文档搜索"
    },
    {
        "time": "0.06:22",
        "name": "074-基础功能-聚合搜索"
    },
    {
        "time": "0.05:21",
        "name": "075-基础功能-索引模板"
    },
    {
        "time": "0.06:47",
        "name": "076-基础功能-中文分词"
    },
    {
        "time": "0.05:10",
        "name": "077-基础功能-文档评分机制-介绍"
    },
    {
        "time": "0.12:11",
        "name": "078-基础功能-文档评分机制-分值计算-TF公式"
    },
    {
        "time": "0.02:10",
        "name": "079-基础功能-文档评分机制-分值计算-IDF公式"
    },
    {
        "time": "0.01:22",
        "name": "080-基础功能-文档评分机制-分值计算-评分公式"
    },
    {
        "time": "0.09:54",
        "name": "081-基础功能-文档评分机制-分值计算-案例"
    },
    {
        "time": "0.03:46",
        "name": "082-基础功能-文档评分机制-分值计算-权重分析"
    },
    {
        "time": "0.08:34",
        "name": "083-进阶功能-Java新API-环境准备"
    },
    {
        "time": "0.12:08",
        "name": "084-进阶功能-Java新API-索引操作-常规"
    },
    {
        "time": "0.04:46",
        "name": "085-进阶功能-Java新API-索引操作-Lambda"
    },
    {
        "time": "0.11:31",
        "name": "086-进阶功能-Java新API-文档操作-常规"
    },
    {
        "time": "0.06:34",
        "name": "087-进阶功能-Java新API-文档操作-Lambda"
    },
    {
        "time": "0.03:54",
        "name": "088-进阶功能-Java新API-文档查询-常规"
    },
    {
        "time": "0.02:22",
        "name": "089-进阶功能-Java新API-文档查询-Lambda"
    },
    {
        "time": "0.05:21",
        "name": "090-进阶功能-Java新API-异步客户端操作"
    },
    {
        "time": "0.01:51",
        "name": "091-进阶功能-EQL-介绍"
    },
    {
        "time": "0.05:29",
        "name": "092-进阶功能-EQL-基础操作"
    },
    {
        "time": "0.06:03",
        "name": "093-进阶功能-EQL-安全检测"
    },
    {
        "time": "0.04:28",
        "name": "094-进阶功能-SQL操作-第一个SQL语句"
    },
    {
        "time": "0.02:59",
        "name": "095-进阶功能-SQL操作-SQL与DSL的关系"
    },
    {
        "time": "0.07:33",
        "name": "096-进阶功能-SQL操作-基础SQL操作"
    },
    {
        "time": "0.06:17",
        "name": "097-进阶功能-SQL操作-常用SQL操作"
    },
    {
        "time": "0.03:54",
        "name": "098-进阶功能-SQL操作-客户端工具DataGrip"
    },
    {
        "time": "0.01:28",
        "name": "099-进阶功能-自然语言处理NLP-介绍"
    },
    {
        "time": "0.05:30",
        "name": "100-进阶功能-自然语言处理NLP-应用"
    },
    {
        "time": "0.03:26",
        "name": "101-优化-性能优化之缓存"
    },
    {
        "time": "0.01:20",
        "name": "102-优化-性能优化之堆大小"
    },
    {
        "time": "0.05:03",
        "name": "103-优化-功能优化"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data