 
 
var data = [
    {
        "time": "0.08:08",
        "name": "01_尚硅谷_zk_开篇_课程介绍"
    },
    {
        "time": "0.06:38",
        "name": "02_尚硅谷_zk_入门_概述"
    },
    {
        "time": "0.05:58",
        "name": "03_尚硅谷_zk_入门_特点"
    },
    {
        "time": "0.01:38",
        "name": "04_尚硅谷_zk_入门_数据结构"
    },
    {
        "time": "0.08:53",
        "name": "05_尚硅谷_zk_入门_应用场景"
    },
    {
        "time": "0.01:47",
        "name": "06_尚硅谷_zk_入门_下载地址"
    },
    {
        "time": "0.10:58",
        "name": "07_尚硅谷_zk_本地_安装"
    },
    {
        "time": "0.02:56",
        "name": "08_尚硅谷_zk_本地_配置参数解读"
    },
    {
        "time": "0.09:33",
        "name": "09_尚硅谷_zk_集群_安装"
    },
    {
        "time": "0.07:40",
        "name": "10_尚硅谷_zk_集群_第一次启动选举机制"
    },
    {
        "time": "0.06:18",
        "name": "11_尚硅谷_zk_集群_非第一次启动选举机制"
    },
    {
        "time": "0.06:46",
        "name": "12_尚硅谷_zk_集群_启动停止脚本"
    },
    {
        "time": "0.06:04",
        "name": "13_尚硅谷_zk_客户端命令行_节点信息"
    },
    {
        "time": "0.11:23",
        "name": "14_尚硅谷_zk_客户端命令行_节点类型"
    },
    {
        "time": "0.10:11",
        "name": "15_尚硅谷_zk_客户端命令行_监听器及节点删除"
    },
    {
        "time": "0.12:38",
        "name": "16_尚硅谷_zk_客户端API_创建节点"
    },
    {
        "time": "0.06:26",
        "name": "17_尚硅谷_zk_客户端API_监听节点变化"
    },
    {
        "time": "0.02:30",
        "name": "18_尚硅谷_zk_客户端API_判断节点是否存在"
    },
    {
        "time": "0.04:39",
        "name": "19_尚硅谷_zk_写数据原理"
    },
    {
        "time": "0.04:41",
        "name": "20_尚硅谷_zk_案例_服务器动态上下线_需求分析"
    },
    {
        "time": "0.10:44",
        "name": "21_尚硅谷_zk_案例_服务器动态上下线_服务器注册"
    },
    {
        "time": "0.10:01",
        "name": "22_尚硅谷_zk_案例_服务器动态上下线_客户端监听"
    },
    {
        "time": "0.06:55",
        "name": "23_尚硅谷_zk_案例_服务器动态上下线_测试"
    },
    {
        "time": "0.05:18",
        "name": "24_尚硅谷_zk_案例_分布式锁_需求分析"
    },
    {
        "time": "0.09:57",
        "name": "25_尚硅谷_zk_案例_分布式锁_代码实现（上）"
    },
    {
        "time": "0.16:19",
        "name": "26_尚硅谷_zk_案例_分布式锁_代码实现（下）"
    },
    {
        "time": "0.05:39",
        "name": "27_尚硅谷_zk_案例_分布式锁_测试"
    },
    {
        "time": "0.09:44",
        "name": "28_尚硅谷_zk_案例_分布式锁_成熟框架curator"
    },
    {
        "time": "0.03:32",
        "name": "29_尚硅谷_zk_企业面试真题"
    },
    {
        "time": "0.04:29",
        "name": "30_尚硅谷_zk_算法基础_拜占庭将军问题"
    },
    {
        "time": "0.13:22",
        "name": "31_尚硅谷_zk_算法基础_paxos算法"
    },
    {
        "time": "0.09:46",
        "name": "32_尚硅谷_zk_算法基础_zab协议"
    },
    {
        "time": "0.03:38",
        "name": "33_尚硅谷_zk_算法基础_cap理论"
    },
    {
        "time": "0.07:59",
        "name": "34_尚硅谷_zk_源码_辅助源码"
    },
    {
        "time": "0.08:14",
        "name": "35_尚硅谷_zk_源码_服务端初始化源码_启动脚本"
    },
    {
        "time": "0.04:41",
        "name": "36_尚硅谷_zk_源码_服务端初始化源码_解析参数"
    },
    {
        "time": "0.05:48",
        "name": "37_尚硅谷_zk_源码_服务端初始化源码_过期快照删除"
    },
    {
        "time": "0.06:39",
        "name": "38_尚硅谷_zk_源码_服务端初始化源码_通信初始化"
    },
    {
        "time": "0.07:26",
        "name": "39_尚硅谷_zk_源码_服务端加载数据源码_编辑日志和快照"
    },
    {
        "time": "0.16:41",
        "name": "40_尚硅谷_zk_源码_选举源码_选举准备"
    },
    {
        "time": "0.12:53",
        "name": "41_尚硅谷_zk_源码_选举源码_选举执行"
    },
    {
        "time": "0.09:59",
        "name": "42_尚硅谷_zk_源码_Leader和Follower状态同步源码_总体分析"
    },
    {
        "time": "0.11:59",
        "name": "43_尚硅谷_zk_源码_Leader和Follower状态同步源码_细节分析"
    },
    {
        "time": "0.03:29",
        "name": "44_尚硅谷_zk_源码_服务端Leader启动源码"
    },
    {
        "time": "0.02:11",
        "name": "45_尚硅谷_zk_源码_服务端Follower启动源码"
    },
    {
        "time": "0.09:31",
        "name": "46_尚硅谷_zk_源码_客户端启动源码"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data