 
 
var data = [
    {
        "time": "0.03:32",
        "name": "01_Nginx从入门到精通_教程简介"
    },
    {
        "time": "0.06:35",
        "name": "02-安装部署-VMware中安装CentOS7.4"
    },
    {
        "time": "0.03:33",
        "name": "03-安装部署-让虚拟机可以联网"
    },
    {
        "time": "0.05:29",
        "name": "04-安装部署-使用XShell给虚拟机配置静态ip"
    },
    {
        "time": "0.09:16",
        "name": "05-安装部署-虚拟机不能上网简单排错"
    },
    {
        "time": "0.05:28",
        "name": "06-安装部署-Nginx四个发行版本简单介绍"
    },
    {
        "time": "0.18:06",
        "name": "07-安装部署-Nginx在CentOS7中编译安装成系统服务"
    },
    {
        "time": "0.08:25",
        "name": "08-基本使用-Nginx的目录结构 在线编辑默认页"
    },
    {
        "time": "0.04:16",
        "name": "09-基本使用-Nginx多进程模型和基本请求流程"
    },
    {
        "time": "0.22:44",
        "name": "10-基本使用-Nginx.conf 最小配置解析"
    },
    {
        "time": "0.01:15",
        "name": "11-基本使用-虚拟主机实战介绍"
    },
    {
        "time": "0.04:08",
        "name": "12-基本使用-浏览器、Nginx与http协议"
    },
    {
        "time": "0.02:57",
        "name": "13-基本使用-虚拟主机原理"
    },
    {
        "time": "0.05:50",
        "name": "14-基本使用-使用host文件解析域名"
    },
    {
        "time": "0.09:10",
        "name": "15-基本使用-公网域名配置与泛域名解析实战"
    },
    {
        "time": "0.08:39",
        "name": "16-基本使用-Nginx虚拟主机域名配置"
    },
    {
        "time": "0.10:00",
        "name": "17-基本使用-servername的多种匹配方式"
    },
    {
        "time": "0.09:29",
        "name": "18-基本使用-基于域名的几种互联网企业需求解析"
    },
    {
        "time": "0.01:32",
        "name": "19-基本使用-反向代理与负载均衡实战介绍"
    },
    {
        "time": "0.12:51",
        "name": "20-基本使用-Nginx隧道式模型 网关、代理与反向代理"
    },
    {
        "time": "0.07:59",
        "name": "21-基本使用-Nginx反向代理在企业中的应用场景"
    },
    {
        "time": "0.04:52",
        "name": "22-基本使用-什么是负载均衡"
    },
    {
        "time": "0.12:12",
        "name": "23-基本使用-反向代理到外网与内网主机的配置"
    },
    {
        "time": "0.03:25",
        "name": "24-基本使用-负载均衡基本配置"
    },
    {
        "time": "0.09:14",
        "name": "25-基本使用-负载均策略之权重、down、backup"
    },
    {
        "time": "0.18:28",
        "name": "26-基本使用-负载均策略之ip_hash、fair、leastconn与无状态回话解决方案"
    },
    {
        "time": "0.05:40",
        "name": "27-基本使用-动静分离的原理与使用场景"
    },
    {
        "time": "0.09:22",
        "name": "28-基本使用-动静分离配置"
    },
    {
        "time": "0.07:25",
        "name": "29-基本使用-使用正则配置动静分离"
    },
    {
        "time": "0.10:40",
        "name": "30-基本使用-URLRewrite 伪静态配置"
    },
    {
        "time": "0.14:29",
        "name": "31-基本使用-网关的概念、伪静态同时负载均衡"
    },
    {
        "time": "0.05:02",
        "name": "32-基本使用-防盗链与http的referer"
    },
    {
        "time": "0.09:19",
        "name": "33-基本使用-防盗链基本配置与none"
    },
    {
        "time": "0.03:53",
        "name": "34-基本使用-使用curl测试防盗链"
    },
    {
        "time": "0.06:50",
        "name": "35-基本使用-企业实战-盗链资源返回页面或提示图片"
    },
    {
        "time": "0.11:37",
        "name": "36-基本使用-高可用场景及解决方案"
    },
    {
        "time": "0.16:03",
        "name": "37-基本使用-最快速度搞定keepalived"
    },
    {
        "time": "0.16:18",
        "name": "38-基本使用-不安全的Http协议"
    },
    {
        "time": "0.04:12",
        "name": "39-基本使用-非对称加密算法原理"
    },
    {
        "time": "0.06:48",
        "name": "40-基本使用-同样不安全的非对称加密算法"
    },
    {
        "time": "0.17:10",
        "name": "41-基本使用-ca机构参与保证互联网安全"
    },
    {
        "time": "0.02:17",
        "name": "42-基本使用-自签名介绍"
    },
    {
        "time": "0.04:47",
        "name": "43-线上实战-购买域名流程"
    },
    {
        "time": "0.05:13",
        "name": "44-线上实战-购买vps流程"
    },
    {
        "time": "0.01:42",
        "name": "45-线上实战-在控制台修改vps密码"
    },
    {
        "time": "0.05:35",
        "name": "46-线上实战-安装LNMP环境防火墙配置"
    },
    {
        "time": "0.03:51",
        "name": "47-线上实战-修改Nginx默认页"
    },
    {
        "time": "0.03:26",
        "name": "48-线上实战-解析域名到主机"
    },
    {
        "time": "0.03:59",
        "name": "49-线上实战-在线申请证书"
    },
    {
        "time": "0.06:06",
        "name": "50-线上实战-把刚申请的证书配置到Nginx上"
    },
    {
        "time": "0.10:38",
        "name": "51-线上实战-安装Discuz与协议自动跳转"
    },
    {
        "time": "0.09:30",
        "name": "052-Nginx高级篇介绍"
    },
    {
        "time": "0.10:13",
        "name": "053-通过扩容提升整体吞吐量"
    },
    {
        "time": "0.09:35",
        "name": "054-服务器硬件扩容及存储选型"
    },
    {
        "time": "0.07:04",
        "name": "055-集群中使用Nginx保持会话的特点"
    },
    {
        "time": "0.11:09",
        "name": "056-iphash维持会话特点及配置"
    },
    {
        "time": "0.09:40",
        "name": "057-在nginx中通过URI维持会话"
    },
    {
        "time": "0.10:32",
        "name": "058-在nginx中使用java的cookie负载均衡"
    },
    {
        "time": "0.19:00",
        "name": "059-使用第三方模块平滑升级"
    },
    {
        "time": "0.11:24",
        "name": "060-sticky上游静态服务器会话保持"
    },
    {
        "time": "0.03:27",
        "name": "061-观察baidu的keepalive"
    },
    {
        "time": "0.02:16",
        "name": "062-什么时候使用keepalive"
    },
    {
        "time": "0.06:06",
        "name": "063-在nginx 中关闭keepalive"
    },
    {
        "time": "0.10:49",
        "name": "064-使用charles工具抓包连接状态"
    },
    {
        "time": "0.21:13",
        "name": "065-nginx对客户端keepalive配置详解"
    },
    {
        "time": "0.09:32",
        "name": "066-nginx对上游服务器使用keepalive配置详解"
    },
    {
        "time": "0.18:22",
        "name": "067-Nginx反向代理开关keepalive性能压测对比"
    },
    {
        "time": "0.16:18",
        "name": "068-Tomcat直连与反向代理性能压测对比"
    },
    {
        "time": "0.05:10",
        "name": "069-http报文结构"
    },
    {
        "time": "0.19:30",
        "name": "070-反向代理内存与文件缓冲区核心流程"
    },
    {
        "time": "0.15:35",
        "name": "071-Nginx对客户端的缓冲和限制"
    },
    {
        "time": "0.10:23",
        "name": "072-使用反向代理后无法获取客户端ip地址"
    },
    {
        "time": "0.10:15",
        "name": "073-使用X-Forwarded-For获取真实ip以及思考"
    },
    {
        "time": "0.07:25",
        "name": "074-一些默认有用的header"
    },
    {
        "time": "0.05:56",
        "name": "075-有哪些网站使用了gzip压缩"
    },
    {
        "time": "0.19:53",
        "name": "076-Gzip动态压缩及缺点"
    },
    {
        "time": "0.05:01",
        "name": "077-gzip_static_module与http_gunzip_module"
    },
    {
        "time": "0.02:59",
        "name": "078-gzip_static_module配置说明"
    },
    {
        "time": "0.13:38",
        "name": "079-gunzip_module配置使用"
    },
    {
        "time": "0.13:33",
        "name": "080-Brotli比gzip更好的压缩格式模块化安装"
    },
    {
        "time": "0.08:44",
        "name": "081-Brotli配置"
    },
    {
        "time": "0.09:05",
        "name": "082-淘宝网案例 进一步压缩客户端的请求数"
    },
    {
        "time": "0.08:00",
        "name": "083-Tengine concat模块安装在开源版本Nginx上"
    },
    {
        "time": "0.12:10",
        "name": "084-模拟淘宝网合并请求效果"
    },
    {
        "time": "0.23:25",
        "name": "085-高并发系统资源静态化方案"
    },
    {
        "time": "0.06:17",
        "name": "086-Nginx SSI 服务器端文件合并"
    },
    {
        "time": "0.07:20",
        "name": "087-Nginx SSI服务器端配置选项"
    },
    {
        "time": "0.09:21",
        "name": "088-Nginx SSI模板命令"
    },
    {
        "time": "0.06:00",
        "name": "089-资源静态同步方案介绍"
    },
    {
        "time": "0.07:49",
        "name": "090-使用rsync手动同步源文件"
    },
    {
        "time": "0.07:35",
        "name": "091-增加安全认证及免密登录"
    },
    {
        "time": "0.06:27",
        "name": "092-近时推送方案"
    },
    {
        "time": "0.06:31",
        "name": "093-实时推送源服务器配置"
    },
    {
        "time": "0.03:51",
        "name": "094-rsync的readonly"
    },
    {
        "time": "0.05:15",
        "name": "095-使用inotify监控目录文件变化"
    },
    {
        "time": "0.07:06",
        "name": "096-rsync inotify 自动化脚本"
    },
    {
        "time": "0.20:34",
        "name": "097-什么是多级缓存"
    },
    {
        "time": "0.09:13",
        "name": "098-京东web端浏览器缓存使用情况"
    },
    {
        "time": "0.14:53",
        "name": "099-浏览器的强制缓存与协商缓存"
    },
    {
        "time": "0.07:53",
        "name": "100-Nginx etag lasmodify配置"
    },
    {
        "time": "0.15:00",
        "name": "101-配合使用etag lasmodify cache-control expires"
    },
    {
        "time": "0.16:02",
        "name": "102-浏览器缓存额外需要注意的事项和应用场景"
    },
    {
        "time": "0.13:31",
        "name": "103-cdn实现原理及场景"
    },
    {
        "time": "0.13:16",
        "name": "104-在云服务器安装GEOIP依赖"
    },
    {
        "time": "0.05:02",
        "name": "105-Nginx下GEOIP模块安装"
    },
    {
        "time": "0.10:45",
        "name": "106-线上获取用户归属地实例配置与智能dns对比"
    },
    {
        "time": "0.12:23",
        "name": "107-使用Nginx作为跳板机正向代理服务器配置"
    },
    {
        "time": "0.21:05",
        "name": "108-反向代理缓存proxy_cache配置"
    },
    {
        "time": "0.06:18",
        "name": "109-缓存清理插件编译安装"
    },
    {
        "time": "0.19:33",
        "name": "110-cache_key 与缓存清理"
    },
    {
        "time": "0.07:56",
        "name": "111-nginx的断点续传"
    },
    {
        "time": "0.21:07",
        "name": "112-proxy_cache配置详解"
    },
    {
        "time": "0.04:00",
        "name": "113-nginx内存缓存介绍"
    },
    {
        "time": "0.04:51",
        "name": "114-nginx外置缓存介绍"
    },
    {
        "time": "0.10:08",
        "name": "115-应用缓存与多级缓存整体结构"
    },
    {
        "time": "0.20:02",
        "name": "116-使用strace追踪内核对sendfile缓存调优"
    },
    {
        "time": "0.08:00",
        "name": "117-errorpage使用"
    },
    {
        "time": "0.06:53",
        "name": "118-匿名location和return"
    },
    {
        "time": "0.17:45",
        "name": "119-Nginx+Memcached完整解决方案"
    },
    {
        "time": "0.20:32",
        "name": "120-开源版Nginx中使用redis2-nginx-module连接redis"
    },
    {
        "time": "0.15:31",
        "name": "121-使用Stream模块为mysql集群透明代理"
    },
    {
        "time": "0.16:44",
        "name": "122-QPS限制模块及使用jemeter压测"
    },
    {
        "time": "0.16:58",
        "name": "123-QPS限制中漏桶算法实现及压测"
    },
    {
        "time": "0.04:35",
        "name": "124-limit_req burst与漏桶算法中bucket概念对比"
    },
    {
        "time": "0.06:20",
        "name": "125-什么是令牌桶算法"
    },
    {
        "time": "0.07:15",
        "name": "126-传输带宽限制"
    },
    {
        "time": "0.07:36",
        "name": "127-客户端并发数限制"
    },
    {
        "time": "0.12:31",
        "name": "128-互联网公司日志的使用场景"
    },
    {
        "time": "0.09:57",
        "name": "129-日志内存缓冲区"
    },
    {
        "time": "0.15:26",
        "name": "130-日志压缩解压缩与json格式输出"
    },
    {
        "time": "0.04:07",
        "name": "131-error日志与日志分割"
    },
    {
        "time": "0.09:08",
        "name": "132-upstream被动式重试机制"
    },
    {
        "time": "0.17:16",
        "name": "133-主动健康检查使用tengine模块"
    },
    {
        "time": "0.11:47",
        "name": "134-Lua luajit nginx openresty关系及开发工具介绍"
    },
    {
        "time": "0.24:46",
        "name": "135-lua基础语法"
    },
    {
        "time": "0.12:57",
        "name": "136-Openresty安装及测试lua代码"
    },
    {
        "time": "0.07:51",
        "name": "137-获取系统变量及参数"
    },
    {
        "time": "0.21:28",
        "name": "138-lua自定义函数、lrucache、shared_dict"
    },
    {
        "time": "0.10:13",
        "name": "139-Openresty连接redis"
    },
    {
        "time": "0.07:48",
        "name": "140-Openresty连接mysql"
    },
    {
        "time": "0.16:29",
        "name": "141-在Openresty中使用模板引擎"
    },
    {
        "time": "0.11:29",
        "name": "142-redis+mysql+模板引擎示例"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data