 
 
var data = [
    {
        "time": "0.04:05",
        "name": "01-课程介绍"
    },
    {
        "time": "0.02:10",
        "name": "02-什么是MQ"
    },
    {
        "time": "0.04:08",
        "name": "03-MQ的流量消峰"
    },
    {
        "time": "0.02:24",
        "name": "04-MQ的应用解耦"
    },
    {
        "time": "0.01:43",
        "name": "05-MQ的异步处理"
    },
    {
        "time": "0.06:56",
        "name": "06-MQ的分类"
    },
    {
        "time": "0.01:43",
        "name": "07-MQ的选择"
    },
    {
        "time": "0.05:41",
        "name": "08-四大核心概念"
    },
    {
        "time": "0.05:00",
        "name": "09-原理名词解释"
    },
    {
        "time": "0.06:54",
        "name": "10-安装"
    },
    {
        "time": "0.04:44",
        "name": "11-安装Web界面插件"
    },
    {
        "time": "0.04:48",
        "name": "12-添加用户并设置权限"
    },
    {
        "time": "0.04:31",
        "name": "13-创建Java开发环境"
    },
    {
        "time": "0.16:45",
        "name": "14-生产者代码"
    },
    {
        "time": "0.12:24",
        "name": "15-消费者代码"
    },
    {
        "time": "0.06:02",
        "name": "16-工作队列原理"
    },
    {
        "time": "0.04:48",
        "name": "17-抽取连接工厂工具类"
    },
    {
        "time": "0.07:55",
        "name": "18-工作线程代码"
    },
    {
        "time": "0.04:55",
        "name": "19-启动2个工作线程"
    },
    {
        "time": "0.06:49",
        "name": "20-工作队列（生产者代码）"
    },
    {
        "time": "0.03:01",
        "name": "21-工作队列（结果成功）"
    },
    {
        "time": "0.10:57",
        "name": "22-消息应答概念"
    },
    {
        "time": "0.04:27",
        "name": "23-消息应答重新入队"
    },
    {
        "time": "0.03:53",
        "name": "24-消息手动应答（注意事项）"
    },
    {
        "time": "0.07:07",
        "name": "25-消息手动应答（生产者）"
    },
    {
        "time": "0.09:52",
        "name": "26-消息手动应答（消费者）"
    },
    {
        "time": "0.06:40",
        "name": "27-消息手动应答（结果成功）"
    },
    {
        "time": "0.06:28",
        "name": "28-队列持久化"
    },
    {
        "time": "0.04:21",
        "name": "29-消息持久化"
    },
    {
        "time": "0.07:55",
        "name": "30-不公平分发"
    },
    {
        "time": "0.14:21",
        "name": "31-预取值"
    },
    {
        "time": "0.06:45",
        "name": "32-发布确认原理"
    },
    {
        "time": "0.12:50",
        "name": "33-单个发布确认"
    },
    {
        "time": "0.08:44",
        "name": "34-批量发布确认"
    },
    {
        "time": "0.05:05",
        "name": "35-异步发布确认原理"
    },
    {
        "time": "0.11:13",
        "name": "36-异步发布确认"
    },
    {
        "time": "0.16:09",
        "name": "37-如何处理异步未确认消息"
    },
    {
        "time": "0.01:56",
        "name": "38-以上3种发布确认速度对比"
    },
    {
        "time": "0.06:56",
        "name": "39-交换机的作用"
    },
    {
        "time": "0.05:18",
        "name": "40-交换机介绍"
    },
    {
        "time": "0.03:21",
        "name": "41-绑定"
    },
    {
        "time": "0.13:36",
        "name": "42-fanout交换机（消费者）"
    },
    {
        "time": "0.05:46",
        "name": "43-fanout交换机（生产者）"
    },
    {
        "time": "0.13:40",
        "name": "44-direct交换机"
    },
    {
        "time": "0.12:12",
        "name": "45-Topic交换机的作用"
    },
    {
        "time": "0.14:10",
        "name": "46-Topic交换机（消费者）"
    },
    {
        "time": "0.08:41",
        "name": "47-Topic交换机（生产者）"
    },
    {
        "time": "0.03:17",
        "name": "48-Topic交换机（结果成功）"
    },
    {
        "time": "0.04:32",
        "name": "49-死信队列"
    },
    {
        "time": "0.05:44",
        "name": "50-死信实战代码架构图"
    },
    {
        "time": "0.19:43",
        "name": "51-死信实战（消费者1）"
    },
    {
        "time": "0.10:32",
        "name": "52-死信实战（生产者)"
    },
    {
        "time": "0.02:29",
        "name": "53-死信实战（消费者2）"
    },
    {
        "time": "0.06:04",
        "name": "54-死信实战（队列达到最大长度）"
    },
    {
        "time": "0.08:17",
        "name": "55-死信实战（消息被拒）"
    },
    {
        "time": "0.11:33",
        "name": "56-延迟队列"
    },
    {
        "time": "0.07:45",
        "name": "57-整合Springboot"
    },
    {
        "time": "0.04:43",
        "name": "58-队列TTL代码架构图"
    },
    {
        "time": "0.18:52",
        "name": "59-队列TTL（配置类代码）"
    },
    {
        "time": "0.07:23",
        "name": "60-队列TTL（生产者）"
    },
    {
        "time": "0.07:10",
        "name": "61-队列TTL（消费者）"
    },
    {
        "time": "0.03:17",
        "name": "62-延迟队列优化"
    },
    {
        "time": "0.07:02",
        "name": "63-延迟队列优化（配置类）"
    },
    {
        "time": "0.06:44",
        "name": "64-延迟队列优化（生产者）"
    },
    {
        "time": "0.06:11",
        "name": "65-延迟队列（基于死信存在问题）"
    },
    {
        "time": "0.08:39",
        "name": "66-延迟队列（基于插件的）"
    },
    {
        "time": "0.12:24",
        "name": "67-基于插件的延迟队列（配置类）"
    },
    {
        "time": "0.04:00",
        "name": "68-基于插件的延迟队列（生产者）"
    },
    {
        "time": "0.06:31",
        "name": "69-基于插件的延迟队列（消费者）"
    },
    {
        "time": "0.03:39",
        "name": "70-总结"
    },
    {
        "time": "0.07:50",
        "name": "71-发布确认高级"
    },
    {
        "time": "0.07:41",
        "name": "72-发布确认高级（配置类）"
    },
    {
        "time": "0.08:39",
        "name": "73-发布确认高级（生产者及消费者）"
    },
    {
        "time": "0.13:53",
        "name": "74-发布确认高级（回调接口）"
    },
    {
        "time": "0.15:18",
        "name": "75-发布确认高级（交换机确认）"
    },
    {
        "time": "0.09:27",
        "name": "76-发布确认高级（回退消息）"
    },
    {
        "time": "0.12:45",
        "name": "77-备份交换机（配置类）"
    },
    {
        "time": "0.06:48",
        "name": "78-备份交换机（结果分析）"
    },
    {
        "time": "0.05:38",
        "name": "79-其他知识点（幂性性）"
    },
    {
        "time": "0.06:02",
        "name": "80-优化级队列（使用场景）"
    },
    {
        "time": "0.09:03",
        "name": "81-优化级队列（代码实现）"
    },
    {
        "time": "0.06:17",
        "name": "82-惰性队列"
    },
    {
        "time": "0.04:26",
        "name": "83-集群原理"
    },
    {
        "time": "0.13:50",
        "name": "84-搭建集群"
    },
    {
        "time": "0.14:42",
        "name": "85-镜像队列"
    },
    {
        "time": "0.05:56",
        "name": "86-实现高可用负载均衡"
    },
    {
        "time": "0.05:13",
        "name": "87-FederationExchange"
    },
    {
        "time": "0.03:40",
        "name": "88-FederationExchange原理"
    },
    {
        "time": "0.07:57",
        "name": "89-FederationExchange实现"
    },
    {
        "time": "0.07:25",
        "name": "90-FederationQueue实现"
    },
    {
        "time": "0.08:19",
        "name": "91-Shovel"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data