 
 
var data = [
    {
        "time": "0.10:17",
        "name": "001-课程简介"
    },
    {
        "time": "0.04:56",
        "name": "002-MQ简介"
    },
    {
        "time": "0.12:59",
        "name": "003-MQ用途"
    },
    {
        "time": "0.08:36",
        "name": "004-常见的MQ产品简介"
    },
    {
        "time": "0.09:07",
        "name": "005-MQ常见协议"
    },
    {
        "time": "0.15:00",
        "name": "006-RocketMQ发展历程"
    },
    {
        "time": "0.06:45",
        "name": "007-基本概念之消息与主题"
    },
    {
        "time": "0.12:11",
        "name": "008-基本概念之队列Queue"
    },
    {
        "time": "0.05:48",
        "name": "009-基本概念之消息标识"
    },
    {
        "time": "0.06:22",
        "name": "010-生产者与生产者组"
    },
    {
        "time": "0.16:25",
        "name": "011-消费者与消费者组"
    },
    {
        "time": "0.07:15",
        "name": "012-NameServer的整体功能介绍"
    },
    {
        "time": "0.10:28",
        "name": "013-NameServer的路由注册"
    },
    {
        "time": "0.09:43",
        "name": "014-NameServer的路由剔除"
    },
    {
        "time": "0.12:33",
        "name": "015-NameServer的路由发现"
    },
    {
        "time": "0.08:47",
        "name": "016-Client对NameServer的选择策略"
    },
    {
        "time": "0.17:21",
        "name": "017-Broker功能介绍"
    },
    {
        "time": "0.08:51",
        "name": "018-RocketMQ工作流程"
    },
    {
        "time": "0.07:59",
        "name": "019-Topic的创建模式"
    },
    {
        "time": "0.17:21",
        "name": "020-读写队列问题"
    },
    {
        "time": "0.08:45",
        "name": "021-克隆一台Linux系统"
    },
    {
        "time": "0.03:43",
        "name": "022-安装前的准备工作"
    },
    {
        "time": "0.03:47",
        "name": "023-修改bin中的两个文件配置"
    },
    {
        "time": "0.06:20",
        "name": "024-rocketMQ的启动"
    },
    {
        "time": "0.10:34",
        "name": "025-发送接收消息测试与关闭server"
    },
    {
        "time": "0.14:37",
        "name": "026-控制台的安装与启动"
    },
    {
        "time": "0.14:07",
        "name": "027-数据复制与刷盘策略"
    },
    {
        "time": "0.11:50",
        "name": "028-单Master与多Master集群模式"
    },
    {
        "time": "0.11:52",
        "name": "029-多Master多Slave集群模式"
    },
    {
        "time": "0.08:39",
        "name": "030-Broker集群模式最佳实践"
    },
    {
        "time": "0.10:27",
        "name": "031-RAID历史与等级简介"
    },
    {
        "time": "0.12:12",
        "name": "032-RAID关键技术与分类"
    },
    {
        "time": "0.11:40",
        "name": "033-JBOD与RAID0等级详解"
    },
    {
        "time": "0.07:07",
        "name": "034-RAID1与RAID0等级详解"
    },
    {
        "time": "0.11:27",
        "name": "035-RAID10与RAID01等级详解"
    },
    {
        "time": "0.15:33",
        "name": "036-集群搭建实践之rocketmqOS1的克隆与配置"
    },
    {
        "time": "0.06:20",
        "name": "037-集群搭建实践之rocketmqOS2的克隆与配置"
    },
    {
        "time": "0.06:25",
        "name": "038-集群搭建实践之启动集群"
    },
    {
        "time": "0.06:01",
        "name": "039-mqadmin命令"
    },
    {
        "time": "0.14:49",
        "name": "040-消息的生产过程"
    },
    {
        "time": "0.11:00",
        "name": "041-Queue选择算法"
    },
    {
        "time": "0.10:02",
        "name": "042-store目录简介"
    },
    {
        "time": "0.17:48",
        "name": "043-commitlog文件"
    },
    {
        "time": "0.12:36",
        "name": "044-commitlog文件的消息单元"
    },
    {
        "time": "0.12:10",
        "name": "045-consumequeue"
    },
    {
        "time": "0.16:04",
        "name": "046-对文件的读写"
    },
    {
        "time": "0.12:54",
        "name": "047-性能提升"
    },
    {
        "time": "0.12:36",
        "name": "048-与Kafka的对比"
    },
    {
        "time": "0.21:46",
        "name": "049-indexFile的结构"
    },
    {
        "time": "0.09:53",
        "name": "050-indexFile的创建"
    },
    {
        "time": "0.16:31",
        "name": "051-indexFile的查询流程"
    },
    {
        "time": "0.06:42",
        "name": "052-两种消息获取方式"
    },
    {
        "time": "0.05:12",
        "name": "053-两种消息消费模式"
    },
    {
        "time": "0.03:15",
        "name": "054-查看Broker中的消费进度"
    },
    {
        "time": "0.18:45",
        "name": "055-Rebalance的限制与危害"
    },
    {
        "time": "0.17:32",
        "name": "056-Rebalance产生的原因与过程"
    },
    {
        "time": "0.09:54",
        "name": "057-Queue分配算法"
    },
    {
        "time": "0.16:41",
        "name": "058-Queue分配算法对比"
    },
    {
        "time": "0.03:31",
        "name": "059-至少一次原则"
    },
    {
        "time": "0.06:18",
        "name": "060-订阅关系的一致性"
    },
    {
        "time": "0.10:42",
        "name": "061-offset的两种管理模式"
    },
    {
        "time": "0.14:53",
        "name": "062-offset远程管理模式"
    },
    {
        "time": "0.13:51",
        "name": "063-消费幂等及消息重复场景分析"
    },
    {
        "time": "0.11:04",
        "name": "064-幂等操作的通用解决方案"
    },
    {
        "time": "0.07:20",
        "name": "065-支付场景中的解决方案"
    },
    {
        "time": "0.06:16",
        "name": "066-消费幂等的实现"
    },
    {
        "time": "0.14:15",
        "name": "067-消息堆积与消费延迟及产生原因分析"
    },
    {
        "time": "0.20:52",
        "name": "068-消费耗时的深入分析"
    },
    {
        "time": "0.15:32",
        "name": "069-消费并发度的深入分析"
    },
    {
        "time": "0.10:13",
        "name": "070-单机线程数计算"
    },
    {
        "time": "0.04:24",
        "name": "071-如何避免消息堆积与消费延迟"
    },
    {
        "time": "0.12:03",
        "name": "072-消息的清理"
    },
    {
        "time": "0.03:43",
        "name": "073-消息发送的三种方式"
    },
    {
        "time": "0.26:05",
        "name": "074-同步消息发送代码举例"
    },
    {
        "time": "0.13:51",
        "name": "075-异步消息发送代码举例"
    },
    {
        "time": "0.02:31",
        "name": "076-单向消息发送代码举例"
    },
    {
        "time": "0.10:17",
        "name": "077-消费者消费代码举例"
    },
    {
        "time": "0.08:36",
        "name": "078-顺序消息的必要性分析"
    },
    {
        "time": "0.24:07",
        "name": "079-消息的有序性分类"
    },
    {
        "time": "0.11:47",
        "name": "080-顺序消息代码举例"
    },
    {
        "time": "0.07:02",
        "name": "081-什么是延迟消息"
    },
    {
        "time": "0.04:15",
        "name": "082-延迟等级划分与设置"
    },
    {
        "time": "0.16:19",
        "name": "083-延迟消息实现原理之修改消息"
    },
    {
        "time": "0.09:40",
        "name": "084-延迟消息实现原理之再次投递消息"
    },
    {
        "time": "0.06:12",
        "name": "085-延迟消费代码举例"
    },
    {
        "time": "0.25:47",
        "name": "086-转账场景中的事务消息解决方案"
    },
    {
        "time": "0.16:15",
        "name": "087-事务消息基础"
    },
    {
        "time": "0.07:06",
        "name": "088-XA模式三剑客"
    },
    {
        "time": "0.08:49",
        "name": "089-XA模式架构"
    },
    {
        "time": "0.22:49",
        "name": "090-事务消息代码举例"
    },
    {
        "time": "0.07:45",
        "name": "091-批量发送消息"
    },
    {
        "time": "0.07:04",
        "name": "092-批量消费消息"
    },
    {
        "time": "0.27:53",
        "name": "093-批量消息代码举例"
    },
    {
        "time": "0.04:16",
        "name": "094-消息过滤"
    },
    {
        "time": "0.06:26",
        "name": "095-消息过滤代码举例"
    },
    {
        "time": "0.08:57",
        "name": "096-开启SQL过滤功能"
    },
    {
        "time": "0.08:06",
        "name": "097-消息发送重试机制"
    },
    {
        "time": "0.26:36",
        "name": "098-消息发送重试的三种策略"
    },
    {
        "time": "0.07:56",
        "name": "099-顺序消息的消费重试机制"
    },
    {
        "time": "0.12:26",
        "name": "100-无序消息的消费重试机制"
    },
    {
        "time": "0.10:40",
        "name": "101-重试队列及其实现原理"
    },
    {
        "time": "0.05:20",
        "name": "102-消费重试配置方式"
    },
    {
        "time": "0.08:55",
        "name": "103-死信队列与死信消息"
    },
    {
        "time": "0.05:26",
        "name": "104-课程总结"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data