 
 
var data = [
    {
        "time": "0.09:32",
        "name": "01-尚硅谷-K8s课程内容介绍"
    },
    {
        "time": "0.15:35",
        "name": "02.尚硅谷_K8s介绍和特性"
    },
    {
        "time": "0.13:28",
        "name": "03.尚硅谷_K8s集群架构组件"
    },
    {
        "time": "0.08:59",
        "name": "04.尚硅谷_K8s核心概念"
    },
    {
        "time": "0.13:06",
        "name": "05.尚硅谷_搭建K8s集群（平台规划和部署方式介绍）"
    },
    {
        "time": "0.15:35",
        "name": "06.尚硅谷_搭建K8s集群（kubeadm方式）-操作系统初始化"
    },
    {
        "time": "0.20:40",
        "name": "07.尚硅谷_搭建K8s集群（kubeadm方式）-部署master节点"
    },
    {
        "time": "0.12:28",
        "name": "08.尚硅谷_搭建K8s集群（kubeadm方式）-部署node节点和集群测试"
    },
    {
        "time": "0.14:03",
        "name": "09.尚硅谷_搭建K8s集群（二进制方式）-搭建步骤介绍"
    },
    {
        "time": "0.04:47",
        "name": "10.尚硅谷_搭建K8s集群（二进制方式）-操作系统初始化"
    },
    {
        "time": "0.05:08",
        "name": "11.尚硅谷_搭建K8s集群（二进制方式）-生成SSL证书文件"
    },
    {
        "time": "0.16:14",
        "name": "12.尚硅谷_搭建K8s集群（二进制方式）-部署etcd集群"
    },
    {
        "time": "0.07:51",
        "name": "13.尚硅谷_搭建K8s集群（二进制方式）-为APIServer自签证书"
    },
    {
        "time": "0.20:55",
        "name": "14.尚硅谷_搭建K8s集群（二进制方式）-部署Master组件"
    },
    {
        "time": "0.06:14",
        "name": "15.尚硅谷_搭建K8s集群（二进制方式）-部署Node组件（安装Docker）"
    },
    {
        "time": "0.11:15",
        "name": "16.尚硅谷_搭建K8s集群（二进制方式）-部署Node组件（kubelet和kube-proxy）"
    },
    {
        "time": "0.05:13",
        "name": "17.尚硅谷_搭建K8s集群（二进制方式）-部署CNI网络和集群测试"
    },
    {
        "time": "0.29:01",
        "name": "18.尚硅谷_搭建K8s集群（两种搭建方式总结）"
    },
    {
        "time": "0.12:17",
        "name": "19.尚硅谷_K8s核心技术-命令行工具kubectl"
    },
    {
        "time": "0.14:47",
        "name": "20.尚硅谷_K8s核心技术-资源编排（yaml）介绍"
    },
    {
        "time": "0.09:37",
        "name": "21.尚硅谷_K8s核心技术-资源编排（yaml）编写方式"
    },
    {
        "time": "0.15:02",
        "name": "22.尚硅谷_K8s核心技术-Pod（概述和存在意义）"
    },
    {
        "time": "0.18:54",
        "name": "23.尚硅谷_K8s核心技术-Pod（两种实现机制）"
    },
    {
        "time": "0.14:41",
        "name": "24.尚硅谷_K8s核心技术-Pod（镜像拉取 重启策略和资源限制）"
    },
    {
        "time": "0.09:12",
        "name": "25.尚硅谷_K8s核心技术-Pod（健康检查）"
    },
    {
        "time": "0.08:40",
        "name": "26.尚硅谷_K8s核心技术-Pod（调度策略）-创建Pod流程"
    },
    {
        "time": "0.10:45",
        "name": "27.尚硅谷_K8s核心技术-Pod（调度策略）-影响Pod调度（资源限制和节点选择器）"
    },
    {
        "time": "0.07:49",
        "name": "28.尚硅谷_K8s核心技术-Pod（调度策略）-影响Pod调度（节点亲和性）"
    },
    {
        "time": "0.20:59",
        "name": "29.尚硅谷_K8s核心技术-Pod（调度策略）-影响Pod调度（污点和污点容忍）"
    },
    {
        "time": "0.12:07",
        "name": "30.尚硅谷_K8s核心技术-Controller（Deployment）-概述和应用场景"
    },
    {
        "time": "0.13:30",
        "name": "31.尚硅谷_K8s核心技术-Controller（Deployment）-发布应用"
    },
    {
        "time": "0.16:47",
        "name": "32.尚硅谷_K8s核心技术-Controller（Deployment）-升级回滚和弹性伸缩"
    },
    {
        "time": "0.14:26",
        "name": "33.尚硅谷_K8s核心技术-Service-概述"
    },
    {
        "time": "0.13:59",
        "name": "34.尚硅谷_K8s核心技术-Service-三种类型"
    },
    {
        "time": "0.18:54",
        "name": "35.尚硅谷_K8s核心技术-Controller（StatefulSet）-部署有状态应用"
    },
    {
        "time": "0.07:43",
        "name": "36.尚硅谷_K8s核心技术-Controller（DaemonSet）-部署守护进程"
    },
    {
        "time": "0.13:44",
        "name": "37.尚硅谷_K8s核心技术-Controller（Job和Cronjob）-一次任务和定时任务"
    },
    {
        "time": "0.15:58",
        "name": "38.尚硅谷_K8s核心技术-配置管理-Secret"
    },
    {
        "time": "0.16:04",
        "name": "39.尚硅谷_K8s核心技术-配置管理-ConfigMap"
    },
    {
        "time": "0.13:09",
        "name": "40.尚硅谷_K8s核心技术-集群安全机制（概述）"
    },
    {
        "time": "0.09:53",
        "name": "41.尚硅谷_K8s核心技术-集群安全机制（RBAC介绍）"
    },
    {
        "time": "0.12:59",
        "name": "42.尚硅谷_K8s核心技术-集群安全机制（RBAC实现鉴权）"
    },
    {
        "time": "0.13:55",
        "name": "43.尚硅谷_K8s核心技术-Ingress（概述）"
    },
    {
        "time": "0.17:59",
        "name": "44.尚硅谷_K8s核心技术-Ingress（对外暴露应用）"
    },
    {
        "time": "0.12:48",
        "name": "45.尚硅谷_K8s核心技术-Helm（引入）"
    },
    {
        "time": "0.14:30",
        "name": "46.尚硅谷_K8s核心技术-Helm（概述）"
    },
    {
        "time": "0.11:10",
        "name": "47.尚硅谷_K8s核心技术-Helm（安装和配置仓库）"
    },
    {
        "time": "0.11:25",
        "name": "48.尚硅谷_K8s核心技术-Helm（快速部署应用）"
    },
    {
        "time": "0.15:35",
        "name": "49.尚硅谷_K8s核心技术-Helm（自定义chart部署）"
    },
    {
        "time": "0.07:58",
        "name": "50.尚硅谷_K8s核心技术-Helm（chart模板使用）上"
    },
    {
        "time": "0.08:33",
        "name": "51.尚硅谷_K8s核心技术-Helm（chart模板使用）下"
    },
    {
        "time": "0.14:10",
        "name": "52.尚硅谷_K8s核心技术-持久化存储（nfs网络存储）"
    },
    {
        "time": "0.11:41",
        "name": "53.尚硅谷_K8s核心技术-持久化存储（pv和pvc）"
    },
    {
        "time": "0.13:35",
        "name": "54.尚硅谷_K8s集群资源监控-监控指标和方案"
    },
    {
        "time": "0.28:05",
        "name": "55.尚硅谷_K8s集群资源监控-搭建监控平台"
    },
    {
        "time": "0.13:54",
        "name": "56.尚硅谷_K8s集群搭建-搭建高可用集群（实现过程介绍）"
    },
    {
        "time": "0.14:52",
        "name": "57.尚硅谷_K8s集群搭建-搭建高可用集群（初始化和部署keepalived）"
    },
    {
        "time": "0.10:32",
        "name": "58.尚硅谷_K8s集群搭建-搭建高可用集群（部署haproxy和安装docker及其他组件）"
    },
    {
        "time": "0.10:37",
        "name": "59.尚硅谷_K8s集群搭建-搭建高可用集群（部署master1节点初始化）"
    },
    {
        "time": "0.13:32",
        "name": "60.尚硅谷_K8s集群搭建-搭建高可用集群（部署master2和node节点）"
    },
    {
        "time": "0.15:41",
        "name": "61.尚硅谷_K8s集群部署项目-容器交付流程介绍"
    },
    {
        "time": "0.19:36",
        "name": "62.尚硅谷_K8s集群部署项目-部署Java项目（制作镜像）"
    },
    {
        "time": "0.10:52",
        "name": "63.尚硅谷_K8s集群部署项目-部署Java项目（推送镜像）"
    },
    {
        "time": "0.10:03",
        "name": "64.尚硅谷_K8s集群部署项目-部署Java项目（部署镜像暴露应用）"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data