 
 
var data = [
    {
        "time": "0.06:02",
        "name": "001.MySQL如何实现的索引机制"
    },
    {
        "time": "0.05:14",
        "name": "002.InnoDB索引与MyISAM索引实现的区别是什么？"
    },
    {
        "time": "0.02:08",
        "name": "003.一个表中如果没有创建索引，那么还会创建B+树吗？"
    },
    {
        "time": "0.12:52",
        "name": "004.说一下B+树索引实现原理（数据结构）"
    },
    {
        "time": "0.18:02",
        "name": "005.聚簇索引与非聚簇索引b+树实现有什么区别？"
    },
    {
        "time": "0.04:37",
        "name": "006.说一下B+树中聚簇索引的查找（匹配）逻辑"
    },
    {
        "time": "0.05:26",
        "name": "007.说一下B+树中非聚簇索引的查找（匹配）逻辑"
    },
    {
        "time": "0.06:02",
        "name": "008.平衡二叉树，红黑树，B树和B+树的区别是什么？都有哪些应用场景？"
    },
    {
        "time": "0.05:44",
        "name": "009.一个b+树中大概能存放多少条索引记录？"
    },
    {
        "time": "0.04:25",
        "name": "010.使用B+树存储的索引crud执行效率如何？"
    },
    {
        "time": "0.02:30",
        "name": "011.什么是自适应哈希索引？"
    },
    {
        "time": "0.02:28",
        "name": "012.什么是2-3树 2-3-4树？"
    },
    {
        "time": "0.06:38",
        "name": "013.说一下自增主键和字符串类型主键的区别和影响"
    },
    {
        "time": "0.12:40",
        "name": "014.使用int自增主键后 最大id是10，删除id 10和9，再添加一条记录，最后添加的id是几？"
    },
    {
        "time": "0.09:57",
        "name": "015.索引的优缺点是什么？"
    },
    {
        "time": "0.03:32",
        "name": "016.使用索引一定能提升效率吗？"
    },
    {
        "time": "0.03:42",
        "name": "017.如果是大段文本内容，如何创建（优化）索引？"
    },
    {
        "time": "0.01:31",
        "name": "018.什么是聚簇索引？"
    },
    {
        "time": "0.00:41",
        "name": "019.一个表中可以有多个（非）聚簇索引吗？"
    },
    {
        "time": "0.00:53",
        "name": "020.聚簇索引与非聚集索引的特点是什么？"
    },
    {
        "time": "0.04:19",
        "name": "021.CRUD时聚簇索引与非聚簇索引的区别是什么？"
    },
    {
        "time": "0.04:16",
        "name": "022.非聚簇索引为什么不存数据地址值而存储主键？"
    },
    {
        "time": "0.02:12",
        "name": "023.什么是回表操作？"
    },
    {
        "time": "0.02:36",
        "name": "024.什么是覆盖索引？"
    },
    {
        "time": "0.04:04",
        "name": "025.非聚集索引一定回表查询吗"
    },
    {
        "time": "0.02:48",
        "name": "026.为什么要回表查询？直接存储数据不可以吗？"
    },
    {
        "time": "0.01:09",
        "name": "027.如果把一个 InnoDB 表的主键删掉，是不是就没有主键，就没办法进行回表查询了？"
    },
    {
        "time": "0.05:01",
        "name": "028.什么是联合索引，组合索引，复合索引？"
    },
    {
        "time": "0.04:15",
        "name": "029.复合索引创建时字段顺序不一样使用效果一样吗？"
    },
    {
        "time": "0.02:11",
        "name": "030.什么是唯一索引？"
    },
    {
        "time": "0.04:20",
        "name": "031.唯一索引是否影响性能？"
    },
    {
        "time": "0.00:36",
        "name": "032.什么时候使用唯一索引？"
    },
    {
        "time": "0.09:03",
        "name": "033.什么时候适合创建索引，什么时候不适合创建索引？"
    },
    {
        "time": "0.06:50",
        "name": "034.什么是索引下推？"
    },
    {
        "time": "0.06:03",
        "name": "035.有哪些情况会导致索引失效？"
    },
    {
        "time": "0.07:11",
        "name": "036.为什么LIKE以%开头索引会失效？"
    },
    {
        "time": "0.01:22",
        "name": "037.一个表有多个索引的时候，能否手动选择使用哪个索引？"
    },
    {
        "time": "0.02:56",
        "name": "038.如何查看一个表的索引？"
    },
    {
        "time": "0.05:28",
        "name": "039.能否查看到索引选择的逻辑？是否使用过optimizer_trace？"
    },
    {
        "time": "0.05:28",
        "name": "040.多个索引优先级是如何匹配的？"
    },
    {
        "time": "0.03:21",
        "name": "041.使用Order By时能否通过索引排序？"
    },
    {
        "time": "0.04:37",
        "name": "042.通过索引排序内部流程是什么？"
    },
    {
        "time": "0.05:05",
        "name": "043.什么是双路排序和单路排序"
    },
    {
        "time": "0.01:17",
        "name": "044.group by 分组和order by在索引使用上有什么区别？"
    },
    {
        "time": "0.01:44",
        "name": "045.如果表中有字段为null，又被经常查询该不该给这个字段创建索引？"
    },
    {
        "time": "0.02:02",
        "name": "046.有字段为null索引是否会失效？"
    },
    {
        "time": "0.02:02",
        "name": "047.MySQL内部支持缓存查询吗？"
    },
    {
        "time": "0.06:34",
        "name": "048.MySQL8为何废弃掉查询缓存？"
    },
    {
        "time": "0.01:17",
        "name": "049.替代方案是什么？"
    },
    {
        "time": "0.08:42",
        "name": "050.MySQL内部有哪些核心模块组成，作用是什么？"
    },
    {
        "time": "0.06:12",
        "name": "051.说一下 MySQL 执行一条查询语句的内部执行过程？"
    },
    {
        "time": "0.01:42",
        "name": "052.MySQL 提示“不存在此列”是执行到哪个节点报出的？"
    },
    {
        "time": "0.01:48",
        "name": "053.如果一张表创建了多个索引，在哪个阶段或模块进行的索引选择？"
    },
    {
        "time": "0.02:30",
        "name": "054.MySQL 支持哪些存储引擎？默认使用哪个？"
    },
    {
        "time": "0.11:17",
        "name": "055.MySQL8.0自带哪些存储引擎？分别是做什么的？"
    },
    {
        "time": "0.06:17",
        "name": "056.MySQL 存储引擎架构了解吗？"
    },
    {
        "time": "0.01:22",
        "name": "057.能否单独为一张表设置存储引擎？"
    },
    {
        "time": "0.02:27",
        "name": "058.阿里、京东等大厂都有自研的存储引擎，如何开发一套自己的？"
    },
    {
        "time": "0.04:10",
        "name": "059.MyISAM 和 InnoDB 的区别是什么？"
    },
    {
        "time": "0.03:15",
        "name": "060.具体说一下如何做技术选型"
    },
    {
        "time": "0.02:12",
        "name": "061.什么是数据库事务？事务的特性是什么？"
    },
    {
        "time": "0.08:22",
        "name": "062.什么是ACID？"
    },
    {
        "time": "0.04:48",
        "name": "063.并发事务会有哪些问题？"
    },
    {
        "time": "0.18:20",
        "name": "064-068题.并发事务会有哪些问题？脏读 丢失修改 不可重复读 幻读"
    },
    {
        "time": "0.13:10",
        "name": "069-73题.MySQL是如何避免事物并发问题的？"
    },
    {
        "time": "0.03:43",
        "name": "074.MySQL事务隔离是如何实现的？"
    },
    {
        "time": "0.06:22",
        "name": "075.什么是一致性非锁定读和锁定读？"
    },
    {
        "time": "0.07:01",
        "name": "076.说一下MVCC内部细节"
    },
    {
        "time": "0.04:11",
        "name": "077-078题.MySQL事务一致性，原子性，持久性是如何实现的？"
    },
    {
        "time": "0.07:05",
        "name": "079-085题.表级锁和行级锁相关面试题？"
    },
    {
        "time": "0.16:55",
        "name": "086-089题.什么是XA协议 MySQL xa事务 与普通事务区别是什么？2pc 3pc的区别"
    },
    {
        "time": "0.06:53",
        "name": "090.是否使用过select for update？会产生哪些操作？"
    },
    {
        "time": "0.07:46",
        "name": "091.说一下MySQL死锁的原因和处理方法"
    },
    {
        "time": "0.04:29",
        "name": "092.MySQL会产生几种日志？"
    },
    {
        "time": "0.08:46",
        "name": "093 -095题.undo log redo log bin log的作用是什么？"
    },
    {
        "time": "0.02:58",
        "name": "096-097题.MySQL日志是否实时写入磁盘？bin log刷盘机制是如何实现的"
    },
    {
        "time": "0.10:59",
        "name": "098-099题.redo log，undo log刷盘机制是如何实现的？数据脏页"
    },
    {
        "time": "0.02:40",
        "name": "100.MySQL的binlog有有几种录入格式？分别有什么区别？.mp4"
    },
    {
        "time": "0.03:38",
        "name": "101.MySQL集群同步时为什么使用binlog？优缺点是什么？"
    },
    {
        "time": "0.07:32",
        "name": "102-105题.文件存储 emoji相关面试题"
    },
    {
        "time": "0.02:30",
        "name": "106.如何存储ip地址？"
    },
    {
        "time": "0.10:34",
        "name": "107-110题.长文本如何存储 如何设计表结构 如何建立索引？等"
    },
    {
        "time": "0.05:30",
        "name": "111-114题.日期，时间如何存取 TIMESTAMP，DATETIME 的区别 为什么不使用字符串存储日期 时间戳 timestamp和int该如何选择？"
    },
    {
        "time": "0.03:11",
        "name": "115.char与varchar的区别？如何选择？"
    },
    {
        "time": "0.07:10",
        "name": "116.财务计算有没有出现过错乱？"
    },
    {
        "time": "0.02:32",
        "name": "117-118题.decimal与float,double的区别是什么？如何选型？"
    },
    {
        "time": "0.05:25",
        "name": "119-120题.预编译sql是什么 好处是什么？"
    },
    {
        "time": "0.08:36",
        "name": "121-125题.join多表关联与优化相关面试题"
    },
    {
        "time": "0.05:32",
        "name": "126-127题.是否有过MySQL调优经验？用过哪些调优工具"
    },
    {
        "time": "0.03:41",
        "name": "128-129题.如何监控线上环境中执行比较慢的sql？如何分析一条慢sql？"
    },
    {
        "time": "0.06:06",
        "name": "130-132题.如何查看当前sql使用了哪个索引？EXPLAIN关键字中的重要指标有哪些？"
    },
    {
        "time": "0.05:22",
        "name": "133.MySQL数据库cpu飙升的话你会如何分析"
    },
    {
        "time": "0.07:11",
        "name": "134-136题.什么是分库分表？什么时候进行分库分表？有没有配合es使用经验？"
    },
    {
        "time": "0.06:48",
        "name": "137-140题.说一下实现分库分表工具的实现思路及读写分离方案"
    },
    {
        "time": "0.04:58",
        "name": "141-144题.视图，外键，存储过程，processlist相关面试题"
    },
    {
        "time": "0.12:47",
        "name": "145.某个表有数千万数据，查询比较慢，如何优化？说一下思路"
    },
    {
        "time": "0.00:49",
        "name": "146.count(列名)和 count(星号)有什么区别.mp4"
    },
    {
        "time": "0.09:07",
        "name": "147.如果有超大分页改怎么处理？"
    },
    {
        "time": "0.06:10",
        "name": "148.MySQL服务器毫无规律的异常重启如何排查问题？"
    },
    {
        "time": "0.05:39",
        "name": "149.MySQL线上修改表结构有哪些风险"
    },
    {
        "time": "0.02:38",
        "name": "150.什么是MySQL多实例部署？"
    }
]// 导出数据变量
// 将数组赋值给全局变量
export default data